Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x801 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><c>: Abbrev Number: 20 (DW_TAG_compile_unit)
    <d>   DW_AT_producer    : (indirect string, offset: 0xb4612): GNU C11 11.3.1 20220712 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <11>   DW_AT_language    : 29	(C11)
    <12>   DW_AT_name        : (indirect string, offset: 0x7d8d9): ../Core/Src/Encoder.c
    <16>   DW_AT_comp_dir    : (indirect string, offset: 0x378d1): C:/Users/vutie/Desktop/KY 2/DAMH/DAMH 2/Debug
    <1a>   DW_AT_ranges      : 0xc
    <1e>   DW_AT_low_pc      : 0x0
    <22>   DW_AT_stmt_list   : 0x0
    <26>   DW_AT_macros      : 0x0
 <1><2a>: Abbrev Number: 6 (DW_TAG_base_type)
    <2b>   DW_AT_byte_size   : 1
    <2c>   DW_AT_encoding    : 6	(signed char)
    <2d>   DW_AT_name        : (indirect string, offset: 0x61c16): signed char
 <1><31>: Abbrev Number: 5 (DW_TAG_typedef)
    <32>   DW_AT_name        : (indirect string, offset: 0x392dc): __uint8_t
    <36>   DW_AT_decl_file   : 2
    <37>   DW_AT_decl_line   : 43
    <38>   DW_AT_decl_column : 24
    <39>   DW_AT_type        : <0x3d>
 <1><3d>: Abbrev Number: 6 (DW_TAG_base_type)
    <3e>   DW_AT_byte_size   : 1
    <3f>   DW_AT_encoding    : 8	(unsigned char)
    <40>   DW_AT_name        : (indirect string, offset: 0xbc44f): unsigned char
 <1><44>: Abbrev Number: 5 (DW_TAG_typedef)
    <45>   DW_AT_name        : (indirect string, offset: 0x9add4): __int16_t
    <49>   DW_AT_decl_file   : 2
    <4a>   DW_AT_decl_line   : 55
    <4b>   DW_AT_decl_column : 24
    <4c>   DW_AT_type        : <0x50>
 <1><50>: Abbrev Number: 6 (DW_TAG_base_type)
    <51>   DW_AT_byte_size   : 2
    <52>   DW_AT_encoding    : 5	(signed)
    <53>   DW_AT_name        : (indirect string, offset: 0x91088): short int
 <1><57>: Abbrev Number: 6 (DW_TAG_base_type)
    <58>   DW_AT_byte_size   : 2
    <59>   DW_AT_encoding    : 7	(unsigned)
    <5a>   DW_AT_name        : (indirect string, offset: 0xbacc6): short unsigned int
 <1><5e>: Abbrev Number: 6 (DW_TAG_base_type)
    <5f>   DW_AT_byte_size   : 4
    <60>   DW_AT_encoding    : 5	(signed)
    <61>   DW_AT_name        : (indirect string, offset: 0x101c5): long int
 <1><65>: Abbrev Number: 5 (DW_TAG_typedef)
    <66>   DW_AT_name        : (indirect string, offset: 0x7c2e0): __uint32_t
    <6a>   DW_AT_decl_file   : 2
    <6b>   DW_AT_decl_line   : 79
    <6c>   DW_AT_decl_column : 25
    <6d>   DW_AT_type        : <0x71>
 <1><71>: Abbrev Number: 6 (DW_TAG_base_type)
    <72>   DW_AT_byte_size   : 4
    <73>   DW_AT_encoding    : 7	(unsigned)
    <74>   DW_AT_name        : (indirect string, offset: 0x4ac18): long unsigned int
 <1><78>: Abbrev Number: 6 (DW_TAG_base_type)
    <79>   DW_AT_byte_size   : 8
    <7a>   DW_AT_encoding    : 5	(signed)
    <7b>   DW_AT_name        : (indirect string, offset: 0x590fc): long long int
 <1><7f>: Abbrev Number: 6 (DW_TAG_base_type)
    <80>   DW_AT_byte_size   : 8
    <81>   DW_AT_encoding    : 7	(unsigned)
    <82>   DW_AT_name        : (indirect string, offset: 0x28f90): long long unsigned int
 <1><86>: Abbrev Number: 21 (DW_TAG_base_type)
    <87>   DW_AT_byte_size   : 4
    <88>   DW_AT_encoding    : 5	(signed)
    <89>   DW_AT_name        : int
 <1><8d>: Abbrev Number: 6 (DW_TAG_base_type)
    <8e>   DW_AT_byte_size   : 4
    <8f>   DW_AT_encoding    : 7	(unsigned)
    <90>   DW_AT_name        : (indirect string, offset: 0x2b73d): unsigned int
 <1><94>: Abbrev Number: 5 (DW_TAG_typedef)
    <95>   DW_AT_name        : (indirect string, offset: 0x392de): uint8_t
    <99>   DW_AT_decl_file   : 3
    <9a>   DW_AT_decl_line   : 24
    <9b>   DW_AT_decl_column : 19
    <9c>   DW_AT_type        : <0x31>
 <1><a0>: Abbrev Number: 5 (DW_TAG_typedef)
    <a1>   DW_AT_name        : (indirect string, offset: 0x9add6): int16_t
    <a5>   DW_AT_decl_file   : 3
    <a6>   DW_AT_decl_line   : 32
    <a7>   DW_AT_decl_column : 19
    <a8>   DW_AT_type        : <0x44>
 <1><ac>: Abbrev Number: 5 (DW_TAG_typedef)
    <ad>   DW_AT_name        : (indirect string, offset: 0xc9ace): uint32_t
    <b1>   DW_AT_decl_file   : 3
    <b2>   DW_AT_decl_line   : 48
    <b3>   DW_AT_decl_column : 20
    <b4>   DW_AT_type        : <0x65>
 <1><b8>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <b9>   DW_AT_type        : <0xac>
 <1><bd>: Abbrev Number: 13 (DW_TAG_structure_type)
    <be>   DW_AT_byte_size   : 24
    <bf>   DW_AT_decl_file   : 4
    <c0>   DW_AT_decl_line   : 345
    <c2>   DW_AT_decl_column : 9
    <c2>   DW_AT_sibling     : <0x114>
 <2><c6>: Abbrev Number: 4 (DW_TAG_member)
    <c7>   DW_AT_name        : CR
    <ca>   DW_AT_decl_file   : 4
    <ca>   DW_AT_decl_line   : 347
    <cc>   DW_AT_decl_column : 17
    <cc>   DW_AT_type        : <0xb8>
    <d0>   DW_AT_data_member_location: 0
 <2><d1>: Abbrev Number: 3 (DW_TAG_member)
    <d2>   DW_AT_name        : (indirect string, offset: 0x4a4b4): NDTR
    <d6>   DW_AT_decl_file   : 4
    <d7>   DW_AT_decl_line   : 348
    <d9>   DW_AT_decl_column : 17
    <da>   DW_AT_type        : <0xb8>
    <de>   DW_AT_data_member_location: 4
 <2><df>: Abbrev Number: 4 (DW_TAG_member)
    <e0>   DW_AT_name        : PAR
    <e4>   DW_AT_decl_file   : 4
    <e4>   DW_AT_decl_line   : 349
    <e6>   DW_AT_decl_column : 17
    <e6>   DW_AT_type        : <0xb8>
    <ea>   DW_AT_data_member_location: 8
 <2><eb>: Abbrev Number: 3 (DW_TAG_member)
    <ec>   DW_AT_name        : (indirect string, offset: 0x511d7): M0AR
    <f0>   DW_AT_decl_file   : 4
    <f1>   DW_AT_decl_line   : 350
    <f3>   DW_AT_decl_column : 17
    <f4>   DW_AT_type        : <0xb8>
    <f8>   DW_AT_data_member_location: 12
 <2><f9>: Abbrev Number: 3 (DW_TAG_member)
    <fa>   DW_AT_name        : (indirect string, offset: 0x6c07b): M1AR
    <fe>   DW_AT_decl_file   : 4
    <ff>   DW_AT_decl_line   : 351
    <101>   DW_AT_decl_column : 17
    <102>   DW_AT_type        : <0xb8>
    <106>   DW_AT_data_member_location: 16
 <2><107>: Abbrev Number: 4 (DW_TAG_member)
    <108>   DW_AT_name        : FCR
    <10c>   DW_AT_decl_file   : 4
    <10c>   DW_AT_decl_line   : 352
    <10e>   DW_AT_decl_column : 17
    <10e>   DW_AT_type        : <0xb8>
    <112>   DW_AT_data_member_location: 20
 <2><113>: Abbrev Number: 0
 <1><114>: Abbrev Number: 7 (DW_TAG_typedef)
    <115>   DW_AT_name        : (indirect string, offset: 0xb0f28): DMA_Stream_TypeDef
    <119>   DW_AT_decl_file   : 4
    <11a>   DW_AT_decl_line   : 353
    <11c>   DW_AT_decl_column : 3
    <11c>   DW_AT_type        : <0xbd>
 <1><120>: Abbrev Number: 13 (DW_TAG_structure_type)
    <121>   DW_AT_byte_size   : 84
    <122>   DW_AT_decl_file   : 4
    <123>   DW_AT_decl_line   : 728
    <125>   DW_AT_decl_column : 9
    <125>   DW_AT_sibling     : <0x23a>
 <2><129>: Abbrev Number: 4 (DW_TAG_member)
    <12a>   DW_AT_name        : CR1
    <12e>   DW_AT_decl_file   : 4
    <12e>   DW_AT_decl_line   : 730
    <130>   DW_AT_decl_column : 17
    <130>   DW_AT_type        : <0xb8>
    <134>   DW_AT_data_member_location: 0
 <2><135>: Abbrev Number: 4 (DW_TAG_member)
    <136>   DW_AT_name        : CR2
    <13a>   DW_AT_decl_file   : 4
    <13a>   DW_AT_decl_line   : 731
    <13c>   DW_AT_decl_column : 17
    <13c>   DW_AT_type        : <0xb8>
    <140>   DW_AT_data_member_location: 4
 <2><141>: Abbrev Number: 3 (DW_TAG_member)
    <142>   DW_AT_name        : (indirect string, offset: 0x39a86): SMCR
    <146>   DW_AT_decl_file   : 4
    <147>   DW_AT_decl_line   : 732
    <149>   DW_AT_decl_column : 17
    <14a>   DW_AT_type        : <0xb8>
    <14e>   DW_AT_data_member_location: 8
 <2><14f>: Abbrev Number: 3 (DW_TAG_member)
    <150>   DW_AT_name        : (indirect string, offset: 0x3f8a0): DIER
    <154>   DW_AT_decl_file   : 4
    <155>   DW_AT_decl_line   : 733
    <157>   DW_AT_decl_column : 17
    <158>   DW_AT_type        : <0xb8>
    <15c>   DW_AT_data_member_location: 12
 <2><15d>: Abbrev Number: 4 (DW_TAG_member)
    <15e>   DW_AT_name        : SR
    <161>   DW_AT_decl_file   : 4
    <161>   DW_AT_decl_line   : 734
    <163>   DW_AT_decl_column : 17
    <163>   DW_AT_type        : <0xb8>
    <167>   DW_AT_data_member_location: 16
 <2><168>: Abbrev Number: 4 (DW_TAG_member)
    <169>   DW_AT_name        : EGR
    <16d>   DW_AT_decl_file   : 4
    <16d>   DW_AT_decl_line   : 735
    <16f>   DW_AT_decl_column : 17
    <16f>   DW_AT_type        : <0xb8>
    <173>   DW_AT_data_member_location: 20
 <2><174>: Abbrev Number: 3 (DW_TAG_member)
    <175>   DW_AT_name        : (indirect string, offset: 0xb1cc0): CCMR1
    <179>   DW_AT_decl_file   : 4
    <17a>   DW_AT_decl_line   : 736
    <17c>   DW_AT_decl_column : 17
    <17d>   DW_AT_type        : <0xb8>
    <181>   DW_AT_data_member_location: 24
 <2><182>: Abbrev Number: 3 (DW_TAG_member)
    <183>   DW_AT_name        : (indirect string, offset: 0x4e01d): CCMR2
    <187>   DW_AT_decl_file   : 4
    <188>   DW_AT_decl_line   : 737
    <18a>   DW_AT_decl_column : 17
    <18b>   DW_AT_type        : <0xb8>
    <18f>   DW_AT_data_member_location: 28
 <2><190>: Abbrev Number: 3 (DW_TAG_member)
    <191>   DW_AT_name        : (indirect string, offset: 0x2fe78): CCER
    <195>   DW_AT_decl_file   : 4
    <196>   DW_AT_decl_line   : 738
    <198>   DW_AT_decl_column : 17
    <199>   DW_AT_type        : <0xb8>
    <19d>   DW_AT_data_member_location: 32
 <2><19e>: Abbrev Number: 4 (DW_TAG_member)
    <19f>   DW_AT_name        : CNT
    <1a3>   DW_AT_decl_file   : 4
    <1a3>   DW_AT_decl_line   : 739
    <1a5>   DW_AT_decl_column : 17
    <1a5>   DW_AT_type        : <0xb8>
    <1a9>   DW_AT_data_member_location: 36
 <2><1aa>: Abbrev Number: 4 (DW_TAG_member)
    <1ab>   DW_AT_name        : PSC
    <1af>   DW_AT_decl_file   : 4
    <1af>   DW_AT_decl_line   : 740
    <1b1>   DW_AT_decl_column : 17
    <1b1>   DW_AT_type        : <0xb8>
    <1b5>   DW_AT_data_member_location: 40
 <2><1b6>: Abbrev Number: 4 (DW_TAG_member)
    <1b7>   DW_AT_name        : ARR
    <1bb>   DW_AT_decl_file   : 4
    <1bb>   DW_AT_decl_line   : 741
    <1bd>   DW_AT_decl_column : 17
    <1bd>   DW_AT_type        : <0xb8>
    <1c1>   DW_AT_data_member_location: 44
 <2><1c2>: Abbrev Number: 4 (DW_TAG_member)
    <1c3>   DW_AT_name        : RCR
    <1c7>   DW_AT_decl_file   : 4
    <1c7>   DW_AT_decl_line   : 742
    <1c9>   DW_AT_decl_column : 17
    <1c9>   DW_AT_type        : <0xb8>
    <1cd>   DW_AT_data_member_location: 48
 <2><1ce>: Abbrev Number: 3 (DW_TAG_member)
    <1cf>   DW_AT_name        : (indirect string, offset: 0x16d38): CCR1
    <1d3>   DW_AT_decl_file   : 4
    <1d4>   DW_AT_decl_line   : 743
    <1d6>   DW_AT_decl_column : 17
    <1d7>   DW_AT_type        : <0xb8>
    <1db>   DW_AT_data_member_location: 52
 <2><1dc>: Abbrev Number: 3 (DW_TAG_member)
    <1dd>   DW_AT_name        : (indirect string, offset: 0x51d7d): CCR2
    <1e1>   DW_AT_decl_file   : 4
    <1e2>   DW_AT_decl_line   : 744
    <1e4>   DW_AT_decl_column : 17
    <1e5>   DW_AT_type        : <0xb8>
    <1e9>   DW_AT_data_member_location: 56
 <2><1ea>: Abbrev Number: 3 (DW_TAG_member)
    <1eb>   DW_AT_name        : (indirect string, offset: 0x94b63): CCR3
    <1ef>   DW_AT_decl_file   : 4
    <1f0>   DW_AT_decl_line   : 745
    <1f2>   DW_AT_decl_column : 17
    <1f3>   DW_AT_type        : <0xb8>
    <1f7>   DW_AT_data_member_location: 60
 <2><1f8>: Abbrev Number: 3 (DW_TAG_member)
    <1f9>   DW_AT_name        : (indirect string, offset: 0xbfdd): CCR4
    <1fd>   DW_AT_decl_file   : 4
    <1fe>   DW_AT_decl_line   : 746
    <200>   DW_AT_decl_column : 17
    <201>   DW_AT_type        : <0xb8>
    <205>   DW_AT_data_member_location: 64
 <2><206>: Abbrev Number: 3 (DW_TAG_member)
    <207>   DW_AT_name        : (indirect string, offset: 0x84b71): BDTR
    <20b>   DW_AT_decl_file   : 4
    <20c>   DW_AT_decl_line   : 747
    <20e>   DW_AT_decl_column : 17
    <20f>   DW_AT_type        : <0xb8>
    <213>   DW_AT_data_member_location: 68
 <2><214>: Abbrev Number: 4 (DW_TAG_member)
    <215>   DW_AT_name        : DCR
    <219>   DW_AT_decl_file   : 4
    <219>   DW_AT_decl_line   : 748
    <21b>   DW_AT_decl_column : 17
    <21b>   DW_AT_type        : <0xb8>
    <21f>   DW_AT_data_member_location: 72
 <2><220>: Abbrev Number: 3 (DW_TAG_member)
    <221>   DW_AT_name        : (indirect string, offset: 0xa7531): DMAR
    <225>   DW_AT_decl_file   : 4
    <226>   DW_AT_decl_line   : 749
    <228>   DW_AT_decl_column : 17
    <229>   DW_AT_type        : <0xb8>
    <22d>   DW_AT_data_member_location: 76
 <2><22e>: Abbrev Number: 4 (DW_TAG_member)
    <22f>   DW_AT_name        : OR
    <232>   DW_AT_decl_file   : 4
    <232>   DW_AT_decl_line   : 750
    <234>   DW_AT_decl_column : 17
    <234>   DW_AT_type        : <0xb8>
    <238>   DW_AT_data_member_location: 80
 <2><239>: Abbrev Number: 0
 <1><23a>: Abbrev Number: 7 (DW_TAG_typedef)
    <23b>   DW_AT_name        : (indirect string, offset: 0xb8939): TIM_TypeDef
    <23f>   DW_AT_decl_file   : 4
    <240>   DW_AT_decl_line   : 751
    <242>   DW_AT_decl_column : 3
    <242>   DW_AT_type        : <0x120>
 <1><246>: Abbrev Number: 6 (DW_TAG_base_type)
    <247>   DW_AT_byte_size   : 8
    <248>   DW_AT_encoding    : 4	(float)
    <249>   DW_AT_name        : (indirect string, offset: 0xc3f49): long double
 <1><24d>: Abbrev Number: 14 (DW_TAG_enumeration_type)
    <24e>   DW_AT_encoding    : 7	(unsigned)
    <24e>   DW_AT_byte_size   : 1
    <24e>   DW_AT_type        : <0x3d>
    <252>   DW_AT_decl_file   : 5
    <253>   DW_AT_decl_line   : 50
    <254>   DW_AT_decl_column : 1
    <254>   DW_AT_sibling     : <0x265>
 <2><258>: Abbrev Number: 2 (DW_TAG_enumerator)
    <259>   DW_AT_name        : (indirect string, offset: 0x8fe34): HAL_UNLOCKED
    <25d>   DW_AT_const_value : 0
 <2><25e>: Abbrev Number: 2 (DW_TAG_enumerator)
    <25f>   DW_AT_name        : (indirect string, offset: 0xc2c41): HAL_LOCKED
    <263>   DW_AT_const_value : 1
 <2><264>: Abbrev Number: 0
 <1><265>: Abbrev Number: 5 (DW_TAG_typedef)
    <266>   DW_AT_name        : (indirect string, offset: 0x735de): HAL_LockTypeDef
    <26a>   DW_AT_decl_file   : 5
    <26b>   DW_AT_decl_line   : 53
    <26c>   DW_AT_decl_column : 3
    <26d>   DW_AT_type        : <0x24d>
 <1><271>: Abbrev Number: 15 (DW_TAG_structure_type)
    <272>   DW_AT_byte_size   : 48
    <273>   DW_AT_decl_file   : 6
    <274>   DW_AT_decl_line   : 48
    <275>   DW_AT_decl_column : 9
    <275>   DW_AT_sibling     : <0x316>
 <2><279>: Abbrev Number: 1 (DW_TAG_member)
    <27a>   DW_AT_name        : (indirect string, offset: 0x657af): Channel
    <27e>   DW_AT_decl_file   : 6
    <27f>   DW_AT_decl_line   : 50
    <280>   DW_AT_decl_column : 12
    <281>   DW_AT_type        : <0xac>
    <285>   DW_AT_data_member_location: 0
 <2><286>: Abbrev Number: 1 (DW_TAG_member)
    <287>   DW_AT_name        : (indirect string, offset: 0xcffc1): Direction
    <28b>   DW_AT_decl_file   : 6
    <28c>   DW_AT_decl_line   : 53
    <28d>   DW_AT_decl_column : 12
    <28e>   DW_AT_type        : <0xac>
    <292>   DW_AT_data_member_location: 4
 <2><293>: Abbrev Number: 1 (DW_TAG_member)
    <294>   DW_AT_name        : (indirect string, offset: 0xcac0): PeriphInc
    <298>   DW_AT_decl_file   : 6
    <299>   DW_AT_decl_line   : 57
    <29a>   DW_AT_decl_column : 12
    <29b>   DW_AT_type        : <0xac>
    <29f>   DW_AT_data_member_location: 8
 <2><2a0>: Abbrev Number: 1 (DW_TAG_member)
    <2a1>   DW_AT_name        : (indirect string, offset: 0x1e859): MemInc
    <2a5>   DW_AT_decl_file   : 6
    <2a6>   DW_AT_decl_line   : 60
    <2a7>   DW_AT_decl_column : 12
    <2a8>   DW_AT_type        : <0xac>
    <2ac>   DW_AT_data_member_location: 12
 <2><2ad>: Abbrev Number: 1 (DW_TAG_member)
    <2ae>   DW_AT_name        : (indirect string, offset: 0x60efa): PeriphDataAlignment
    <2b2>   DW_AT_decl_file   : 6
    <2b3>   DW_AT_decl_line   : 63
    <2b4>   DW_AT_decl_column : 12
    <2b5>   DW_AT_type        : <0xac>
    <2b9>   DW_AT_data_member_location: 16
 <2><2ba>: Abbrev Number: 1 (DW_TAG_member)
    <2bb>   DW_AT_name        : (indirect string, offset: 0xb0447): MemDataAlignment
    <2bf>   DW_AT_decl_file   : 6
    <2c0>   DW_AT_decl_line   : 66
    <2c1>   DW_AT_decl_column : 12
    <2c2>   DW_AT_type        : <0xac>
    <2c6>   DW_AT_data_member_location: 20
 <2><2c7>: Abbrev Number: 1 (DW_TAG_member)
    <2c8>   DW_AT_name        : (indirect string, offset: 0xcc242): Mode
    <2cc>   DW_AT_decl_file   : 6
    <2cd>   DW_AT_decl_line   : 69
    <2ce>   DW_AT_decl_column : 12
    <2cf>   DW_AT_type        : <0xac>
    <2d3>   DW_AT_data_member_location: 24
 <2><2d4>: Abbrev Number: 1 (DW_TAG_member)
    <2d5>   DW_AT_name        : (indirect string, offset: 0xcf54a): Priority
    <2d9>   DW_AT_decl_file   : 6
    <2da>   DW_AT_decl_line   : 74
    <2db>   DW_AT_decl_column : 12
    <2dc>   DW_AT_type        : <0xac>
    <2e0>   DW_AT_data_member_location: 28
 <2><2e1>: Abbrev Number: 1 (DW_TAG_member)
    <2e2>   DW_AT_name        : (indirect string, offset: 0x542b7): FIFOMode
    <2e6>   DW_AT_decl_file   : 6
    <2e7>   DW_AT_decl_line   : 77
    <2e8>   DW_AT_decl_column : 12
    <2e9>   DW_AT_type        : <0xac>
    <2ed>   DW_AT_data_member_location: 32
 <2><2ee>: Abbrev Number: 1 (DW_TAG_member)
    <2ef>   DW_AT_name        : (indirect string, offset: 0x94113): FIFOThreshold
    <2f3>   DW_AT_decl_file   : 6
    <2f4>   DW_AT_decl_line   : 82
    <2f5>   DW_AT_decl_column : 12
    <2f6>   DW_AT_type        : <0xac>
    <2fa>   DW_AT_data_member_location: 36
 <2><2fb>: Abbrev Number: 1 (DW_TAG_member)
    <2fc>   DW_AT_name        : (indirect string, offset: 0x923b6): MemBurst
    <300>   DW_AT_decl_file   : 6
    <301>   DW_AT_decl_line   : 85
    <302>   DW_AT_decl_column : 12
    <303>   DW_AT_type        : <0xac>
    <307>   DW_AT_data_member_location: 40
 <2><308>: Abbrev Number: 1 (DW_TAG_member)
    <309>   DW_AT_name        : (indirect string, offset: 0x43076): PeriphBurst
    <30d>   DW_AT_decl_file   : 6
    <30e>   DW_AT_decl_line   : 91
    <30f>   DW_AT_decl_column : 12
    <310>   DW_AT_type        : <0xac>
    <314>   DW_AT_data_member_location: 44
 <2><315>: Abbrev Number: 0
 <1><316>: Abbrev Number: 5 (DW_TAG_typedef)
    <317>   DW_AT_name        : (indirect string, offset: 0x34dbe): DMA_InitTypeDef
    <31b>   DW_AT_decl_file   : 6
    <31c>   DW_AT_decl_line   : 96
    <31d>   DW_AT_decl_column : 2
    <31e>   DW_AT_type        : <0x271>
 <1><322>: Abbrev Number: 14 (DW_TAG_enumeration_type)
    <323>   DW_AT_encoding    : 7	(unsigned)
    <323>   DW_AT_byte_size   : 1
    <323>   DW_AT_type        : <0x3d>
    <327>   DW_AT_decl_file   : 6
    <328>   DW_AT_decl_line   : 103
    <329>   DW_AT_decl_column : 1
    <329>   DW_AT_sibling     : <0x352>
 <2><32d>: Abbrev Number: 2 (DW_TAG_enumerator)
    <32e>   DW_AT_name        : (indirect string, offset: 0xc5fe): HAL_DMA_STATE_RESET
    <332>   DW_AT_const_value : 0
 <2><333>: Abbrev Number: 2 (DW_TAG_enumerator)
    <334>   DW_AT_name        : (indirect string, offset: 0x360f8): HAL_DMA_STATE_READY
    <338>   DW_AT_const_value : 1
 <2><339>: Abbrev Number: 2 (DW_TAG_enumerator)
    <33a>   DW_AT_name        : (indirect string, offset: 0x8678d): HAL_DMA_STATE_BUSY
    <33e>   DW_AT_const_value : 2
 <2><33f>: Abbrev Number: 2 (DW_TAG_enumerator)
    <340>   DW_AT_name        : (indirect string, offset: 0xbfc4a): HAL_DMA_STATE_TIMEOUT
    <344>   DW_AT_const_value : 3
 <2><345>: Abbrev Number: 2 (DW_TAG_enumerator)
    <346>   DW_AT_name        : (indirect string, offset: 0x93b92): HAL_DMA_STATE_ERROR
    <34a>   DW_AT_const_value : 4
 <2><34b>: Abbrev Number: 2 (DW_TAG_enumerator)
    <34c>   DW_AT_name        : (indirect string, offset: 0x4c77e): HAL_DMA_STATE_ABORT
    <350>   DW_AT_const_value : 5
 <2><351>: Abbrev Number: 0
 <1><352>: Abbrev Number: 5 (DW_TAG_typedef)
    <353>   DW_AT_name        : (indirect string, offset: 0xaf79a): HAL_DMA_StateTypeDef
    <357>   DW_AT_decl_file   : 6
    <358>   DW_AT_decl_line   : 110
    <359>   DW_AT_decl_column : 2
    <35a>   DW_AT_type        : <0x322>
 <1><35e>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <35f>   DW_AT_type        : <0x352>
 <1><363>: Abbrev Number: 16 (DW_TAG_structure_type)
    <364>   DW_AT_name        : (indirect string, offset: 0xa5b81): __DMA_HandleTypeDef
    <368>   DW_AT_byte_size   : 96
    <369>   DW_AT_decl_file   : 6
    <36a>   DW_AT_decl_line   : 138
    <36b>   DW_AT_decl_column : 16
    <36b>   DW_AT_sibling     : <0x426>
 <2><36f>: Abbrev Number: 1 (DW_TAG_member)
    <370>   DW_AT_name        : (indirect string, offset: 0xbc869): Instance
    <374>   DW_AT_decl_file   : 6
    <375>   DW_AT_decl_line   : 140
    <376>   DW_AT_decl_column : 31
    <377>   DW_AT_type        : <0x426>
    <37b>   DW_AT_data_member_location: 0
 <2><37c>: Abbrev Number: 1 (DW_TAG_member)
    <37d>   DW_AT_name        : (indirect string, offset: 0xcc279): Init
    <381>   DW_AT_decl_file   : 6
    <382>   DW_AT_decl_line   : 142
    <383>   DW_AT_decl_column : 30
    <384>   DW_AT_type        : <0x316>
    <388>   DW_AT_data_member_location: 4
 <2><389>: Abbrev Number: 1 (DW_TAG_member)
    <38a>   DW_AT_name        : (indirect string, offset: 0x8aa74): Lock
    <38e>   DW_AT_decl_file   : 6
    <38f>   DW_AT_decl_line   : 144
    <390>   DW_AT_decl_column : 30
    <391>   DW_AT_type        : <0x265>
    <395>   DW_AT_data_member_location: 52
 <2><396>: Abbrev Number: 1 (DW_TAG_member)
    <397>   DW_AT_name        : (indirect string, offset: 0xcd2bf): State
    <39b>   DW_AT_decl_file   : 6
    <39c>   DW_AT_decl_line   : 146
    <39d>   DW_AT_decl_column : 30
    <39e>   DW_AT_type        : <0x35e>
    <3a2>   DW_AT_data_member_location: 53
 <2><3a3>: Abbrev Number: 1 (DW_TAG_member)
    <3a4>   DW_AT_name        : (indirect string, offset: 0xb9761): Parent
    <3a8>   DW_AT_decl_file   : 6
    <3a9>   DW_AT_decl_line   : 148
    <3aa>   DW_AT_decl_column : 31
    <3ab>   DW_AT_type        : <0x42b>
    <3af>   DW_AT_data_member_location: 56
 <2><3b0>: Abbrev Number: 1 (DW_TAG_member)
    <3b1>   DW_AT_name        : (indirect string, offset: 0xc216c): XferCpltCallback
    <3b5>   DW_AT_decl_file   : 6
    <3b6>   DW_AT_decl_line   : 150
    <3b7>   DW_AT_decl_column : 33
    <3b8>   DW_AT_type        : <0x43d>
    <3bc>   DW_AT_data_member_location: 60
 <2><3bd>: Abbrev Number: 1 (DW_TAG_member)
    <3be>   DW_AT_name        : (indirect string, offset: 0x97725): XferHalfCpltCallback
    <3c2>   DW_AT_decl_file   : 6
    <3c3>   DW_AT_decl_line   : 152
    <3c4>   DW_AT_decl_column : 33
    <3c5>   DW_AT_type        : <0x43d>
    <3c9>   DW_AT_data_member_location: 64
 <2><3ca>: Abbrev Number: 1 (DW_TAG_member)
    <3cb>   DW_AT_name        : (indirect string, offset: 0x72b99): XferM1CpltCallback
    <3cf>   DW_AT_decl_file   : 6
    <3d0>   DW_AT_decl_line   : 154
    <3d1>   DW_AT_decl_column : 33
    <3d2>   DW_AT_type        : <0x43d>
    <3d6>   DW_AT_data_member_location: 68
 <2><3d7>: Abbrev Number: 1 (DW_TAG_member)
    <3d8>   DW_AT_name        : (indirect string, offset: 0x5de38): XferM1HalfCpltCallback
    <3dc>   DW_AT_decl_file   : 6
    <3dd>   DW_AT_decl_line   : 156
    <3de>   DW_AT_decl_column : 33
    <3df>   DW_AT_type        : <0x43d>
    <3e3>   DW_AT_data_member_location: 72
 <2><3e4>: Abbrev Number: 1 (DW_TAG_member)
    <3e5>   DW_AT_name        : (indirect string, offset: 0x1c177): XferErrorCallback
    <3e9>   DW_AT_decl_file   : 6
    <3ea>   DW_AT_decl_line   : 158
    <3eb>   DW_AT_decl_column : 33
    <3ec>   DW_AT_type        : <0x43d>
    <3f0>   DW_AT_data_member_location: 76
 <2><3f1>: Abbrev Number: 1 (DW_TAG_member)
    <3f2>   DW_AT_name        : (indirect string, offset: 0xb5fb5): XferAbortCallback
    <3f6>   DW_AT_decl_file   : 6
    <3f7>   DW_AT_decl_line   : 160
    <3f8>   DW_AT_decl_column : 33
    <3f9>   DW_AT_type        : <0x43d>
    <3fd>   DW_AT_data_member_location: 80
 <2><3fe>: Abbrev Number: 1 (DW_TAG_member)
    <3ff>   DW_AT_name        : (indirect string, offset: 0xbe9bd): ErrorCode
    <403>   DW_AT_decl_file   : 6
    <404>   DW_AT_decl_line   : 162
    <405>   DW_AT_decl_column : 30
    <406>   DW_AT_type        : <0xb8>
    <40a>   DW_AT_data_member_location: 84
 <2><40b>: Abbrev Number: 1 (DW_TAG_member)
    <40c>   DW_AT_name        : (indirect string, offset: 0x573b8): StreamBaseAddress
    <410>   DW_AT_decl_file   : 6
    <411>   DW_AT_decl_line   : 164
    <412>   DW_AT_decl_column : 30
    <413>   DW_AT_type        : <0xac>
    <417>   DW_AT_data_member_location: 88
 <2><418>: Abbrev Number: 1 (DW_TAG_member)
    <419>   DW_AT_name        : (indirect string, offset: 0xa3c94): StreamIndex
    <41d>   DW_AT_decl_file   : 6
    <41e>   DW_AT_decl_line   : 166
    <41f>   DW_AT_decl_column : 30
    <420>   DW_AT_type        : <0xac>
    <424>   DW_AT_data_member_location: 92
 <2><425>: Abbrev Number: 0
 <1><426>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <427>   DW_AT_byte_size   : 4
    <427>   DW_AT_type        : <0x114>
 <1><42b>: Abbrev Number: 22 (DW_TAG_pointer_type)
    <42c>   DW_AT_byte_size   : 4
 <1><42d>: Abbrev Number: 23 (DW_TAG_subroutine_type)
    <42e>   DW_AT_prototyped  : 1
    <42e>   DW_AT_sibling     : <0x438>
 <2><432>: Abbrev Number: 24 (DW_TAG_formal_parameter)
    <433>   DW_AT_type        : <0x438>
 <2><437>: Abbrev Number: 0
 <1><438>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <439>   DW_AT_byte_size   : 4
    <439>   DW_AT_type        : <0x363>
 <1><43d>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <43e>   DW_AT_byte_size   : 4
    <43e>   DW_AT_type        : <0x42d>
 <1><442>: Abbrev Number: 5 (DW_TAG_typedef)
    <443>   DW_AT_name        : (indirect string, offset: 0xa5b83): DMA_HandleTypeDef
    <447>   DW_AT_decl_file   : 6
    <448>   DW_AT_decl_line   : 168
    <449>   DW_AT_decl_column : 2
    <44a>   DW_AT_type        : <0x363>
 <1><44e>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <44f>   DW_AT_byte_size   : 4
    <44f>   DW_AT_type        : <0x442>
 <1><453>: Abbrev Number: 15 (DW_TAG_structure_type)
    <454>   DW_AT_byte_size   : 24
    <455>   DW_AT_decl_file   : 7
    <456>   DW_AT_decl_line   : 46
    <457>   DW_AT_decl_column : 9
    <457>   DW_AT_sibling     : <0x4aa>
 <2><45b>: Abbrev Number: 1 (DW_TAG_member)
    <45c>   DW_AT_name        : (indirect string, offset: 0xcebd3): Prescaler
    <460>   DW_AT_decl_file   : 7
    <461>   DW_AT_decl_line   : 48
    <462>   DW_AT_decl_column : 12
    <463>   DW_AT_type        : <0xac>
    <467>   DW_AT_data_member_location: 0
 <2><468>: Abbrev Number: 1 (DW_TAG_member)
    <469>   DW_AT_name        : (indirect string, offset: 0xb10c3): CounterMode
    <46d>   DW_AT_decl_file   : 7
    <46e>   DW_AT_decl_line   : 51
    <46f>   DW_AT_decl_column : 12
    <470>   DW_AT_type        : <0xac>
    <474>   DW_AT_data_member_location: 4
 <2><475>: Abbrev Number: 1 (DW_TAG_member)
    <476>   DW_AT_name        : (indirect string, offset: 0x97f4a): Period
    <47a>   DW_AT_decl_file   : 7
    <47b>   DW_AT_decl_line   : 54
    <47c>   DW_AT_decl_column : 12
    <47d>   DW_AT_type        : <0xac>
    <481>   DW_AT_data_member_location: 8
 <2><482>: Abbrev Number: 1 (DW_TAG_member)
    <483>   DW_AT_name        : (indirect string, offset: 0x4f67d): ClockDivision
    <487>   DW_AT_decl_file   : 7
    <488>   DW_AT_decl_line   : 58
    <489>   DW_AT_decl_column : 12
    <48a>   DW_AT_type        : <0xac>
    <48e>   DW_AT_data_member_location: 12
 <2><48f>: Abbrev Number: 1 (DW_TAG_member)
    <490>   DW_AT_name        : (indirect string, offset: 0x87eff): RepetitionCounter
    <494>   DW_AT_decl_file   : 7
    <495>   DW_AT_decl_line   : 61
    <496>   DW_AT_decl_column : 12
    <497>   DW_AT_type        : <0xac>
    <49b>   DW_AT_data_member_location: 16
 <2><49c>: Abbrev Number: 1 (DW_TAG_member)
    <49d>   DW_AT_name        : (indirect string, offset: 0xb3ce0): AutoReloadPreload
    <4a1>   DW_AT_decl_file   : 7
    <4a2>   DW_AT_decl_line   : 72
    <4a3>   DW_AT_decl_column : 12
    <4a4>   DW_AT_type        : <0xac>
    <4a8>   DW_AT_data_member_location: 20
 <2><4a9>: Abbrev Number: 0
 <1><4aa>: Abbrev Number: 5 (DW_TAG_typedef)
    <4ab>   DW_AT_name        : (indirect string, offset: 0x4399c): TIM_Base_InitTypeDef
    <4af>   DW_AT_decl_file   : 7
    <4b0>   DW_AT_decl_line   : 74
    <4b1>   DW_AT_decl_column : 3
    <4b2>   DW_AT_type        : <0x453>
 <1><4b6>: Abbrev Number: 12 (DW_TAG_enumeration_type)
    <4b7>   DW_AT_encoding    : 7	(unsigned)
    <4b7>   DW_AT_byte_size   : 1
    <4b7>   DW_AT_type        : <0x3d>
    <4bb>   DW_AT_decl_file   : 7
    <4bb>   DW_AT_decl_line   : 291
    <4bd>   DW_AT_decl_column : 1
    <4bd>   DW_AT_sibling     : <0x4e0>
 <2><4c1>: Abbrev Number: 2 (DW_TAG_enumerator)
    <4c2>   DW_AT_name        : (indirect string, offset: 0x7a5df): HAL_TIM_STATE_RESET
    <4c6>   DW_AT_const_value : 0
 <2><4c7>: Abbrev Number: 2 (DW_TAG_enumerator)
    <4c8>   DW_AT_name        : (indirect string, offset: 0x6c48): HAL_TIM_STATE_READY
    <4cc>   DW_AT_const_value : 1
 <2><4cd>: Abbrev Number: 2 (DW_TAG_enumerator)
    <4ce>   DW_AT_name        : (indirect string, offset: 0x31997): HAL_TIM_STATE_BUSY
    <4d2>   DW_AT_const_value : 2
 <2><4d3>: Abbrev Number: 2 (DW_TAG_enumerator)
    <4d4>   DW_AT_name        : (indirect string, offset: 0xa2dd7): HAL_TIM_STATE_TIMEOUT
    <4d8>   DW_AT_const_value : 3
 <2><4d9>: Abbrev Number: 2 (DW_TAG_enumerator)
    <4da>   DW_AT_name        : (indirect string, offset: 0x78836): HAL_TIM_STATE_ERROR
    <4de>   DW_AT_const_value : 4
 <2><4df>: Abbrev Number: 0
 <1><4e0>: Abbrev Number: 7 (DW_TAG_typedef)
    <4e1>   DW_AT_name        : (indirect string, offset: 0x7fe31): HAL_TIM_StateTypeDef
    <4e5>   DW_AT_decl_file   : 7
    <4e6>   DW_AT_decl_line   : 297
    <4e8>   DW_AT_decl_column : 3
    <4e8>   DW_AT_type        : <0x4b6>
 <1><4ec>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <4ed>   DW_AT_type        : <0x4e0>
 <1><4f1>: Abbrev Number: 12 (DW_TAG_enumeration_type)
    <4f2>   DW_AT_encoding    : 7	(unsigned)
    <4f2>   DW_AT_byte_size   : 1
    <4f2>   DW_AT_type        : <0x3d>
    <4f6>   DW_AT_decl_file   : 7
    <4f6>   DW_AT_decl_line   : 303
    <4f8>   DW_AT_decl_column : 1
    <4f8>   DW_AT_sibling     : <0x50f>
 <2><4fc>: Abbrev Number: 2 (DW_TAG_enumerator)
    <4fd>   DW_AT_name        : (indirect string, offset: 0x8939b): HAL_TIM_CHANNEL_STATE_RESET
    <501>   DW_AT_const_value : 0
 <2><502>: Abbrev Number: 2 (DW_TAG_enumerator)
    <503>   DW_AT_name        : (indirect string, offset: 0x72e97): HAL_TIM_CHANNEL_STATE_READY
    <507>   DW_AT_const_value : 1
 <2><508>: Abbrev Number: 2 (DW_TAG_enumerator)
    <509>   DW_AT_name        : (indirect string, offset: 0x5e04f): HAL_TIM_CHANNEL_STATE_BUSY
    <50d>   DW_AT_const_value : 2
 <2><50e>: Abbrev Number: 0
 <1><50f>: Abbrev Number: 7 (DW_TAG_typedef)
    <510>   DW_AT_name        : (indirect string, offset: 0x294e4): HAL_TIM_ChannelStateTypeDef
    <514>   DW_AT_decl_file   : 7
    <515>   DW_AT_decl_line   : 307
    <517>   DW_AT_decl_column : 3
    <517>   DW_AT_type        : <0x4f1>
 <1><51b>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <51c>   DW_AT_type        : <0x50f>
 <1><520>: Abbrev Number: 12 (DW_TAG_enumeration_type)
    <521>   DW_AT_encoding    : 7	(unsigned)
    <521>   DW_AT_byte_size   : 1
    <521>   DW_AT_type        : <0x3d>
    <525>   DW_AT_decl_file   : 7
    <525>   DW_AT_decl_line   : 313
    <527>   DW_AT_decl_column : 1
    <527>   DW_AT_sibling     : <0x53e>
 <2><52b>: Abbrev Number: 2 (DW_TAG_enumerator)
    <52c>   DW_AT_name        : (indirect string, offset: 0x3e2c): HAL_DMA_BURST_STATE_RESET
    <530>   DW_AT_const_value : 0
 <2><531>: Abbrev Number: 2 (DW_TAG_enumerator)
    <532>   DW_AT_name        : (indirect string, offset: 0x6bb2f): HAL_DMA_BURST_STATE_READY
    <536>   DW_AT_const_value : 1
 <2><537>: Abbrev Number: 2 (DW_TAG_enumerator)
    <538>   DW_AT_name        : (indirect string, offset: 0x421b4): HAL_DMA_BURST_STATE_BUSY
    <53c>   DW_AT_const_value : 2
 <2><53d>: Abbrev Number: 0
 <1><53e>: Abbrev Number: 7 (DW_TAG_typedef)
    <53f>   DW_AT_name        : (indirect string, offset: 0x1a777): HAL_TIM_DMABurstStateTypeDef
    <543>   DW_AT_decl_file   : 7
    <544>   DW_AT_decl_line   : 317
    <546>   DW_AT_decl_column : 3
    <546>   DW_AT_type        : <0x520>
 <1><54a>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <54b>   DW_AT_type        : <0x53e>
 <1><54f>: Abbrev Number: 12 (DW_TAG_enumeration_type)
    <550>   DW_AT_encoding    : 7	(unsigned)
    <550>   DW_AT_byte_size   : 1
    <550>   DW_AT_type        : <0x3d>
    <554>   DW_AT_decl_file   : 7
    <554>   DW_AT_decl_line   : 323
    <556>   DW_AT_decl_column : 1
    <556>   DW_AT_sibling     : <0x579>
 <2><55a>: Abbrev Number: 2 (DW_TAG_enumerator)
    <55b>   DW_AT_name        : (indirect string, offset: 0x6db5e): HAL_TIM_ACTIVE_CHANNEL_1
    <55f>   DW_AT_const_value : 1
 <2><560>: Abbrev Number: 2 (DW_TAG_enumerator)
    <561>   DW_AT_name        : (indirect string, offset: 0x6db77): HAL_TIM_ACTIVE_CHANNEL_2
    <565>   DW_AT_const_value : 2
 <2><566>: Abbrev Number: 2 (DW_TAG_enumerator)
    <567>   DW_AT_name        : (indirect string, offset: 0x6db90): HAL_TIM_ACTIVE_CHANNEL_3
    <56b>   DW_AT_const_value : 4
 <2><56c>: Abbrev Number: 2 (DW_TAG_enumerator)
    <56d>   DW_AT_name        : (indirect string, offset: 0x6dba9): HAL_TIM_ACTIVE_CHANNEL_4
    <571>   DW_AT_const_value : 8
 <2><572>: Abbrev Number: 2 (DW_TAG_enumerator)
    <573>   DW_AT_name        : (indirect string, offset: 0x507fd): HAL_TIM_ACTIVE_CHANNEL_CLEARED
    <577>   DW_AT_const_value : 0
 <2><578>: Abbrev Number: 0
 <1><579>: Abbrev Number: 7 (DW_TAG_typedef)
    <57a>   DW_AT_name        : (indirect string, offset: 0x657a1): HAL_TIM_ActiveChannel
    <57e>   DW_AT_decl_file   : 7
    <57f>   DW_AT_decl_line   : 329
    <581>   DW_AT_decl_column : 3
    <581>   DW_AT_type        : <0x54f>
 <1><585>: Abbrev Number: 13 (DW_TAG_structure_type)
    <586>   DW_AT_byte_size   : 72
    <587>   DW_AT_decl_file   : 7
    <588>   DW_AT_decl_line   : 337
    <58a>   DW_AT_decl_column : 9
    <58a>   DW_AT_sibling     : <0x60d>
 <2><58e>: Abbrev Number: 3 (DW_TAG_member)
    <58f>   DW_AT_name        : (indirect string, offset: 0xbc869): Instance
    <593>   DW_AT_decl_file   : 7
    <594>   DW_AT_decl_line   : 340
    <596>   DW_AT_decl_column : 39
    <597>   DW_AT_type        : <0x60d>
    <59b>   DW_AT_data_member_location: 0
 <2><59c>: Abbrev Number: 3 (DW_TAG_member)
    <59d>   DW_AT_name        : (indirect string, offset: 0xcc279): Init
    <5a1>   DW_AT_decl_file   : 7
    <5a2>   DW_AT_decl_line   : 341
    <5a4>   DW_AT_decl_column : 38
    <5a5>   DW_AT_type        : <0x4aa>
    <5a9>   DW_AT_data_member_location: 4
 <2><5aa>: Abbrev Number: 3 (DW_TAG_member)
    <5ab>   DW_AT_name        : (indirect string, offset: 0x657af): Channel
    <5af>   DW_AT_decl_file   : 7
    <5b0>   DW_AT_decl_line   : 342
    <5b2>   DW_AT_decl_column : 38
    <5b3>   DW_AT_type        : <0x579>
    <5b7>   DW_AT_data_member_location: 28
 <2><5b8>: Abbrev Number: 3 (DW_TAG_member)
    <5b9>   DW_AT_name        : (indirect string, offset: 0x7534b): hdma
    <5bd>   DW_AT_decl_file   : 7
    <5be>   DW_AT_decl_line   : 343
    <5c0>   DW_AT_decl_column : 39
    <5c1>   DW_AT_type        : <0x612>
    <5c5>   DW_AT_data_member_location: 32
 <2><5c6>: Abbrev Number: 3 (DW_TAG_member)
    <5c7>   DW_AT_name        : (indirect string, offset: 0x8aa74): Lock
    <5cb>   DW_AT_decl_file   : 7
    <5cc>   DW_AT_decl_line   : 345
    <5ce>   DW_AT_decl_column : 38
    <5cf>   DW_AT_type        : <0x265>
    <5d3>   DW_AT_data_member_location: 60
 <2><5d4>: Abbrev Number: 3 (DW_TAG_member)
    <5d5>   DW_AT_name        : (indirect string, offset: 0xcd2bf): State
    <5d9>   DW_AT_decl_file   : 7
    <5da>   DW_AT_decl_line   : 346
    <5dc>   DW_AT_decl_column : 38
    <5dd>   DW_AT_type        : <0x4ec>
    <5e1>   DW_AT_data_member_location: 61
 <2><5e2>: Abbrev Number: 3 (DW_TAG_member)
    <5e3>   DW_AT_name        : (indirect string, offset: 0xd10c3): ChannelState
    <5e7>   DW_AT_decl_file   : 7
    <5e8>   DW_AT_decl_line   : 347
    <5ea>   DW_AT_decl_column : 38
    <5eb>   DW_AT_type        : <0x632>
    <5ef>   DW_AT_data_member_location: 62
 <2><5f0>: Abbrev Number: 3 (DW_TAG_member)
    <5f1>   DW_AT_name        : (indirect string, offset: 0xd163c): ChannelNState
    <5f5>   DW_AT_decl_file   : 7
    <5f6>   DW_AT_decl_line   : 348
    <5f8>   DW_AT_decl_column : 38
    <5f9>   DW_AT_type        : <0x632>
    <5fd>   DW_AT_data_member_location: 66
 <2><5fe>: Abbrev Number: 3 (DW_TAG_member)
    <5ff>   DW_AT_name        : (indirect string, offset: 0xd0cf7): DMABurstState
    <603>   DW_AT_decl_file   : 7
    <604>   DW_AT_decl_line   : 349
    <606>   DW_AT_decl_column : 38
    <607>   DW_AT_type        : <0x54a>
    <60b>   DW_AT_data_member_location: 70
 <2><60c>: Abbrev Number: 0
 <1><60d>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <60e>   DW_AT_byte_size   : 4
    <60e>   DW_AT_type        : <0x23a>
 <1><612>: Abbrev Number: 17 (DW_TAG_array_type)
    <613>   DW_AT_type        : <0x44e>
    <617>   DW_AT_sibling     : <0x622>
 <2><61b>: Abbrev Number: 18 (DW_TAG_subrange_type)
    <61c>   DW_AT_type        : <0x8d>
    <620>   DW_AT_upper_bound : 6
 <2><621>: Abbrev Number: 0
 <1><622>: Abbrev Number: 17 (DW_TAG_array_type)
    <623>   DW_AT_type        : <0x51b>
    <627>   DW_AT_sibling     : <0x632>
 <2><62b>: Abbrev Number: 18 (DW_TAG_subrange_type)
    <62c>   DW_AT_type        : <0x8d>
    <630>   DW_AT_upper_bound : 3
 <2><631>: Abbrev Number: 0
 <1><632>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <633>   DW_AT_type        : <0x622>
 <1><637>: Abbrev Number: 7 (DW_TAG_typedef)
    <638>   DW_AT_name        : (indirect string, offset: 0x4340d): TIM_HandleTypeDef
    <63c>   DW_AT_decl_file   : 7
    <63d>   DW_AT_decl_line   : 380
    <63f>   DW_AT_decl_column : 3
    <63f>   DW_AT_type        : <0x585>
 <1><643>: Abbrev Number: 16 (DW_TAG_structure_type)
    <644>   DW_AT_name        : (indirect string, offset: 0x88474): EncoderRead
    <648>   DW_AT_byte_size   : 72
    <649>   DW_AT_decl_file   : 8
    <64a>   DW_AT_decl_line   : 15
    <64b>   DW_AT_decl_column : 16
    <64b>   DW_AT_sibling     : <0x6ec>
 <2><64f>: Abbrev Number: 1 (DW_TAG_member)
    <650>   DW_AT_name        : (indirect string, offset: 0x991d5): htim
    <654>   DW_AT_decl_file   : 8
    <655>   DW_AT_decl_line   : 17
    <656>   DW_AT_decl_column : 21
    <657>   DW_AT_type        : <0x6ec>
    <65b>   DW_AT_data_member_location: 0
 <2><65c>: Abbrev Number: 1 (DW_TAG_member)
    <65d>   DW_AT_name        : (indirect string, offset: 0x8f503): count_Timer
    <661>   DW_AT_decl_file   : 8
    <662>   DW_AT_decl_line   : 18
    <663>   DW_AT_decl_column : 10
    <664>   DW_AT_type        : <0xa0>
    <668>   DW_AT_data_member_location: 4
 <2><669>: Abbrev Number: 1 (DW_TAG_member)
    <66a>   DW_AT_name        : (indirect string, offset: 0x34ad3): count_X4
    <66e>   DW_AT_decl_file   : 8
    <66f>   DW_AT_decl_line   : 19
    <670>   DW_AT_decl_column : 6
    <671>   DW_AT_type        : <0x86>
    <675>   DW_AT_data_member_location: 8
 <2><676>: Abbrev Number: 1 (DW_TAG_member)
    <677>   DW_AT_name        : (indirect string, offset: 0x1a382): count_X1
    <67b>   DW_AT_decl_file   : 8
    <67c>   DW_AT_decl_line   : 20
    <67d>   DW_AT_decl_column : 6
    <67e>   DW_AT_type        : <0x86>
    <682>   DW_AT_data_member_location: 12
 <2><683>: Abbrev Number: 1 (DW_TAG_member)
    <684>   DW_AT_name        : (indirect string, offset: 0x80e8d): count_Pre
    <688>   DW_AT_decl_file   : 8
    <689>   DW_AT_decl_line   : 21
    <68a>   DW_AT_decl_column : 6
    <68b>   DW_AT_type        : <0x86>
    <68f>   DW_AT_data_member_location: 16
 <2><690>: Abbrev Number: 1 (DW_TAG_member)
    <691>   DW_AT_name        : (indirect string, offset: 0x943d8): count_PerRevol
    <695>   DW_AT_decl_file   : 8
    <696>   DW_AT_decl_line   : 22
    <697>   DW_AT_decl_column : 6
    <698>   DW_AT_type        : <0x86>
    <69c>   DW_AT_data_member_location: 20
 <2><69d>: Abbrev Number: 1 (DW_TAG_member)
    <69e>   DW_AT_name        : (indirect string, offset: 0x12abb): count_Mode
    <6a2>   DW_AT_decl_file   : 8
    <6a3>   DW_AT_decl_line   : 23
    <6a4>   DW_AT_decl_column : 10
    <6a5>   DW_AT_type        : <0x94>
    <6a9>   DW_AT_data_member_location: 24
 <2><6aa>: Abbrev Number: 1 (DW_TAG_member)
    <6ab>   DW_AT_name        : (indirect string, offset: 0x6ff7a): vel_Real
    <6af>   DW_AT_decl_file   : 8
    <6b0>   DW_AT_decl_line   : 25
    <6b1>   DW_AT_decl_column : 9
    <6b2>   DW_AT_type        : <0x6f1>
    <6b6>   DW_AT_data_member_location: 32
 <2><6b7>: Abbrev Number: 1 (DW_TAG_member)
    <6b8>   DW_AT_name        : (indirect string, offset: 0x503c8): vel_Pre
    <6bc>   DW_AT_decl_file   : 8
    <6bd>   DW_AT_decl_line   : 26
    <6be>   DW_AT_decl_column : 9
    <6bf>   DW_AT_type        : <0x6f1>
    <6c3>   DW_AT_data_member_location: 40
 <2><6c4>: Abbrev Number: 1 (DW_TAG_member)
    <6c5>   DW_AT_name        : (indirect string, offset: 0x19ead): vel_Fil
    <6c9>   DW_AT_decl_file   : 8
    <6ca>   DW_AT_decl_line   : 27
    <6cb>   DW_AT_decl_column : 9
    <6cc>   DW_AT_type        : <0x6f1>
    <6d0>   DW_AT_data_member_location: 48
 <2><6d1>: Abbrev Number: 1 (DW_TAG_member)
    <6d2>   DW_AT_name        : (indirect string, offset: 0x8a56d): Degree
    <6d6>   DW_AT_decl_file   : 8
    <6d7>   DW_AT_decl_line   : 29
    <6d8>   DW_AT_decl_column : 9
    <6d9>   DW_AT_type        : <0x6f1>
    <6dd>   DW_AT_data_member_location: 56
 <2><6de>: Abbrev Number: 1 (DW_TAG_member)
    <6df>   DW_AT_name        : (indirect string, offset: 0xb9768): deltaT
    <6e3>   DW_AT_decl_file   : 8
    <6e4>   DW_AT_decl_line   : 30
    <6e5>   DW_AT_decl_column : 9
    <6e6>   DW_AT_type        : <0x6f1>
    <6ea>   DW_AT_data_member_location: 64
 <2><6eb>: Abbrev Number: 0
 <1><6ec>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <6ed>   DW_AT_byte_size   : 4
    <6ed>   DW_AT_type        : <0x637>
 <1><6f1>: Abbrev Number: 6 (DW_TAG_base_type)
    <6f2>   DW_AT_byte_size   : 8
    <6f3>   DW_AT_encoding    : 4	(float)
    <6f4>   DW_AT_name        : (indirect string, offset: 0xc97a9): double
 <1><6f8>: Abbrev Number: 5 (DW_TAG_typedef)
    <6f9>   DW_AT_name        : (indirect string, offset: 0x88474): EncoderRead
    <6fd>   DW_AT_decl_file   : 8
    <6fe>   DW_AT_decl_line   : 31
    <6ff>   DW_AT_decl_column : 2
    <700>   DW_AT_type        : <0x643>
 <1><704>: Abbrev Number: 25 (DW_TAG_subprogram)
    <705>   DW_AT_external    : 1
    <705>   DW_AT_name        : (indirect string, offset: 0x21a82): ResetCount
    <709>   DW_AT_decl_file   : 1
    <70a>   DW_AT_decl_line   : 62
    <70b>   DW_AT_decl_column : 6
    <70c>   DW_AT_prototyped  : 1
    <70c>   DW_AT_low_pc      : 0x0
    <710>   DW_AT_high_pc     : 0x2e
    <714>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <716>   DW_AT_call_all_calls: 1
    <716>   DW_AT_sibling     : <0x737>
 <2><71a>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <71b>   DW_AT_name        : enc
    <71f>   DW_AT_decl_file   : 1
    <71f>   DW_AT_decl_line   : 62
    <720>   DW_AT_decl_column : 30
    <721>   DW_AT_type        : <0x737>
    <725>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><728>: Abbrev Number: 11 (DW_TAG_formal_parameter)
    <729>   DW_AT_name        : (indirect string, offset: 0xf89d): command
    <72d>   DW_AT_decl_file   : 1
    <72d>   DW_AT_decl_line   : 62
    <72e>   DW_AT_decl_column : 42
    <72f>   DW_AT_type        : <0x94>
    <733>   DW_AT_location    : 2 byte block: 91 73 	(DW_OP_fbreg: -13)
 <2><736>: Abbrev Number: 0
 <1><737>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <738>   DW_AT_byte_size   : 4
    <738>   DW_AT_type        : <0x6f8>
 <1><73c>: Abbrev Number: 26 (DW_TAG_subprogram)
    <73d>   DW_AT_external    : 1
    <73d>   DW_AT_name        : (indirect string, offset: 0x3959a): CountRead
    <741>   DW_AT_decl_file   : 1
    <742>   DW_AT_decl_line   : 40
    <743>   DW_AT_decl_column : 8
    <744>   DW_AT_prototyped  : 1
    <744>   DW_AT_type        : <0x6f1>
    <748>   DW_AT_low_pc      : 0x8000fe4
    <74c>   DW_AT_high_pc     : 0xcc
    <750>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <752>   DW_AT_call_all_tail_calls: 1
    <752>   DW_AT_sibling     : <0x773>
 <2><756>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <757>   DW_AT_name        : enc
    <75b>   DW_AT_decl_file   : 1
    <75b>   DW_AT_decl_line   : 40
    <75c>   DW_AT_decl_column : 31
    <75d>   DW_AT_type        : <0x737>
    <761>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><764>: Abbrev Number: 11 (DW_TAG_formal_parameter)
    <765>   DW_AT_name        : (indirect string, offset: 0xbff43): count_mode
    <769>   DW_AT_decl_file   : 1
    <769>   DW_AT_decl_line   : 40
    <76a>   DW_AT_decl_column : 43
    <76b>   DW_AT_type        : <0x94>
    <76f>   DW_AT_location    : 2 byte block: 91 73 	(DW_OP_fbreg: -13)
 <2><772>: Abbrev Number: 0
 <1><773>: Abbrev Number: 19 (DW_TAG_subprogram)
    <774>   DW_AT_external    : 1
    <774>   DW_AT_name        : (indirect string, offset: 0x959c9): SpeedReadNonReset
    <778>   DW_AT_decl_file   : 1
    <778>   DW_AT_decl_line   : 29
    <779>   DW_AT_decl_column : 6
    <779>   DW_AT_prototyped  : 1
    <779>   DW_AT_low_pc      : 0x8000ec8
    <77d>   DW_AT_high_pc     : 0x11c
    <781>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <783>   DW_AT_call_all_tail_calls: 1
    <783>   DW_AT_sibling     : <0x796>
 <2><787>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <788>   DW_AT_name        : enc
    <78c>   DW_AT_decl_file   : 1
    <78c>   DW_AT_decl_line   : 29
    <78d>   DW_AT_decl_column : 37
    <78e>   DW_AT_type        : <0x737>
    <792>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><795>: Abbrev Number: 0
 <1><796>: Abbrev Number: 19 (DW_TAG_subprogram)
    <797>   DW_AT_external    : 1
    <797>   DW_AT_name        : (indirect string, offset: 0x6c60d): SpeedReadOnly
    <79b>   DW_AT_decl_file   : 1
    <79b>   DW_AT_decl_line   : 16
    <79c>   DW_AT_decl_column : 6
    <79c>   DW_AT_prototyped  : 1
    <79c>   DW_AT_low_pc      : 0x0
    <7a0>   DW_AT_high_pc     : 0x114
    <7a4>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <7a6>   DW_AT_call_all_tail_calls: 1
    <7a6>   DW_AT_sibling     : <0x7b9>
 <2><7aa>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <7ab>   DW_AT_name        : enc
    <7af>   DW_AT_decl_file   : 1
    <7af>   DW_AT_decl_line   : 16
    <7b0>   DW_AT_decl_column : 33
    <7b1>   DW_AT_type        : <0x737>
    <7b5>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><7b8>: Abbrev Number: 0
 <1><7b9>: Abbrev Number: 27 (DW_TAG_subprogram)
    <7ba>   DW_AT_external    : 1
    <7ba>   DW_AT_name        : (indirect string, offset: 0x4235f): EncoderSetting
    <7be>   DW_AT_decl_file   : 1
    <7bf>   DW_AT_decl_line   : 10
    <7c0>   DW_AT_decl_column : 6
    <7c1>   DW_AT_prototyped  : 1
    <7c1>   DW_AT_low_pc      : 0x8000e94
    <7c5>   DW_AT_high_pc     : 0x32
    <7c9>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <7cb>   DW_AT_call_all_calls: 1
 <2><7cb>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <7cc>   DW_AT_name        : enc
    <7d0>   DW_AT_decl_file   : 1
    <7d0>   DW_AT_decl_line   : 10
    <7d1>   DW_AT_decl_column : 34
    <7d2>   DW_AT_type        : <0x737>
    <7d6>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><7d9>: Abbrev Number: 11 (DW_TAG_formal_parameter)
    <7da>   DW_AT_name        : (indirect string, offset: 0x991d5): htim
    <7de>   DW_AT_decl_file   : 1
    <7de>   DW_AT_decl_line   : 10
    <7df>   DW_AT_decl_column : 57
    <7e0>   DW_AT_type        : <0x6ec>
    <7e4>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><7e7>: Abbrev Number: 11 (DW_TAG_formal_parameter)
    <7e8>   DW_AT_name        : (indirect string, offset: 0x943d8): count_PerRevol
    <7ec>   DW_AT_decl_file   : 1
    <7ec>   DW_AT_decl_line   : 10
    <7ed>   DW_AT_decl_column : 66
    <7ee>   DW_AT_type        : <0x86>
    <7f2>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><7f5>: Abbrev Number: 11 (DW_TAG_formal_parameter)
    <7f6>   DW_AT_name        : (indirect string, offset: 0xb9768): deltaT
    <7fa>   DW_AT_decl_file   : 1
    <7fa>   DW_AT_decl_line   : 10
    <7fb>   DW_AT_decl_column : 88
    <7fc>   DW_AT_type        : <0x6f1>
    <800>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <2><803>: Abbrev Number: 0
 <1><804>: Abbrev Number: 0
  Compilation Unit @ offset 0x805:
   Length:        0x71b (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x1b4
   Pointer Size:  4
 <0><811>: Abbrev Number: 19 (DW_TAG_compile_unit)
    <812>   DW_AT_producer    : (indirect string, offset: 0xb4612): GNU C11 11.3.1 20220712 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <816>   DW_AT_language    : 29	(C11)
    <817>   DW_AT_name        : (indirect string, offset: 0xc54bc): ../Core/Src/MotorDrive.c
    <81b>   DW_AT_comp_dir    : (indirect string, offset: 0x378d1): C:/Users/vutie/Desktop/KY 2/DAMH/DAMH 2/Debug
    <81f>   DW_AT_ranges      : 0x3a
    <823>   DW_AT_low_pc      : 0x0
    <827>   DW_AT_stmt_list   : 0x8c1
    <82b>   DW_AT_macros      : 0x1ed50
 <1><82f>: Abbrev Number: 6 (DW_TAG_base_type)
    <830>   DW_AT_byte_size   : 1
    <831>   DW_AT_encoding    : 6	(signed char)
    <832>   DW_AT_name        : (indirect string, offset: 0x61c16): signed char
 <1><836>: Abbrev Number: 5 (DW_TAG_typedef)
    <837>   DW_AT_name        : (indirect string, offset: 0xc3ca6): __int8_t
    <83b>   DW_AT_decl_file   : 2
    <83c>   DW_AT_decl_line   : 41
    <83d>   DW_AT_decl_column : 23
    <83e>   DW_AT_type        : <0x82f>
 <1><842>: Abbrev Number: 6 (DW_TAG_base_type)
    <843>   DW_AT_byte_size   : 1
    <844>   DW_AT_encoding    : 8	(unsigned char)
    <845>   DW_AT_name        : (indirect string, offset: 0xbc44f): unsigned char
 <1><849>: Abbrev Number: 6 (DW_TAG_base_type)
    <84a>   DW_AT_byte_size   : 2
    <84b>   DW_AT_encoding    : 5	(signed)
    <84c>   DW_AT_name        : (indirect string, offset: 0x91088): short int
 <1><850>: Abbrev Number: 5 (DW_TAG_typedef)
    <851>   DW_AT_name        : (indirect string, offset: 0xc62de): __uint16_t
    <855>   DW_AT_decl_file   : 2
    <856>   DW_AT_decl_line   : 57
    <857>   DW_AT_decl_column : 25
    <858>   DW_AT_type        : <0x85c>
 <1><85c>: Abbrev Number: 6 (DW_TAG_base_type)
    <85d>   DW_AT_byte_size   : 2
    <85e>   DW_AT_encoding    : 7	(unsigned)
    <85f>   DW_AT_name        : (indirect string, offset: 0xbacc6): short unsigned int
 <1><863>: Abbrev Number: 6 (DW_TAG_base_type)
    <864>   DW_AT_byte_size   : 4
    <865>   DW_AT_encoding    : 5	(signed)
    <866>   DW_AT_name        : (indirect string, offset: 0x101c5): long int
 <1><86a>: Abbrev Number: 5 (DW_TAG_typedef)
    <86b>   DW_AT_name        : (indirect string, offset: 0x7c2e0): __uint32_t
    <86f>   DW_AT_decl_file   : 2
    <870>   DW_AT_decl_line   : 79
    <871>   DW_AT_decl_column : 25
    <872>   DW_AT_type        : <0x876>
 <1><876>: Abbrev Number: 6 (DW_TAG_base_type)
    <877>   DW_AT_byte_size   : 4
    <878>   DW_AT_encoding    : 7	(unsigned)
    <879>   DW_AT_name        : (indirect string, offset: 0x4ac18): long unsigned int
 <1><87d>: Abbrev Number: 6 (DW_TAG_base_type)
    <87e>   DW_AT_byte_size   : 8
    <87f>   DW_AT_encoding    : 5	(signed)
    <880>   DW_AT_name        : (indirect string, offset: 0x590fc): long long int
 <1><884>: Abbrev Number: 6 (DW_TAG_base_type)
    <885>   DW_AT_byte_size   : 8
    <886>   DW_AT_encoding    : 7	(unsigned)
    <887>   DW_AT_name        : (indirect string, offset: 0x28f90): long long unsigned int
 <1><88b>: Abbrev Number: 20 (DW_TAG_base_type)
    <88c>   DW_AT_byte_size   : 4
    <88d>   DW_AT_encoding    : 5	(signed)
    <88e>   DW_AT_name        : int
 <1><892>: Abbrev Number: 6 (DW_TAG_base_type)
    <893>   DW_AT_byte_size   : 4
    <894>   DW_AT_encoding    : 7	(unsigned)
    <895>   DW_AT_name        : (indirect string, offset: 0x2b73d): unsigned int
 <1><899>: Abbrev Number: 5 (DW_TAG_typedef)
    <89a>   DW_AT_name        : (indirect string, offset: 0xc3ca8): int8_t
    <89e>   DW_AT_decl_file   : 3
    <89f>   DW_AT_decl_line   : 20
    <8a0>   DW_AT_decl_column : 18
    <8a1>   DW_AT_type        : <0x836>
 <1><8a5>: Abbrev Number: 5 (DW_TAG_typedef)
    <8a6>   DW_AT_name        : (indirect string, offset: 0xc9aee): uint16_t
    <8aa>   DW_AT_decl_file   : 3
    <8ab>   DW_AT_decl_line   : 36
    <8ac>   DW_AT_decl_column : 20
    <8ad>   DW_AT_type        : <0x850>
 <1><8b1>: Abbrev Number: 5 (DW_TAG_typedef)
    <8b2>   DW_AT_name        : (indirect string, offset: 0xc9ace): uint32_t
    <8b6>   DW_AT_decl_file   : 3
    <8b7>   DW_AT_decl_line   : 48
    <8b8>   DW_AT_decl_column : 20
    <8b9>   DW_AT_type        : <0x86a>
 <1><8bd>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <8be>   DW_AT_type        : <0x8b1>
 <1><8c2>: Abbrev Number: 12 (DW_TAG_structure_type)
    <8c3>   DW_AT_byte_size   : 24
    <8c4>   DW_AT_decl_file   : 4
    <8c5>   DW_AT_decl_line   : 345
    <8c7>   DW_AT_decl_column : 9
    <8c7>   DW_AT_sibling     : <0x919>
 <2><8cb>: Abbrev Number: 4 (DW_TAG_member)
    <8cc>   DW_AT_name        : CR
    <8cf>   DW_AT_decl_file   : 4
    <8cf>   DW_AT_decl_line   : 347
    <8d1>   DW_AT_decl_column : 17
    <8d1>   DW_AT_type        : <0x8bd>
    <8d5>   DW_AT_data_member_location: 0
 <2><8d6>: Abbrev Number: 3 (DW_TAG_member)
    <8d7>   DW_AT_name        : (indirect string, offset: 0x4a4b4): NDTR
    <8db>   DW_AT_decl_file   : 4
    <8dc>   DW_AT_decl_line   : 348
    <8de>   DW_AT_decl_column : 17
    <8df>   DW_AT_type        : <0x8bd>
    <8e3>   DW_AT_data_member_location: 4
 <2><8e4>: Abbrev Number: 4 (DW_TAG_member)
    <8e5>   DW_AT_name        : PAR
    <8e9>   DW_AT_decl_file   : 4
    <8e9>   DW_AT_decl_line   : 349
    <8eb>   DW_AT_decl_column : 17
    <8eb>   DW_AT_type        : <0x8bd>
    <8ef>   DW_AT_data_member_location: 8
 <2><8f0>: Abbrev Number: 3 (DW_TAG_member)
    <8f1>   DW_AT_name        : (indirect string, offset: 0x511d7): M0AR
    <8f5>   DW_AT_decl_file   : 4
    <8f6>   DW_AT_decl_line   : 350
    <8f8>   DW_AT_decl_column : 17
    <8f9>   DW_AT_type        : <0x8bd>
    <8fd>   DW_AT_data_member_location: 12
 <2><8fe>: Abbrev Number: 3 (DW_TAG_member)
    <8ff>   DW_AT_name        : (indirect string, offset: 0x6c07b): M1AR
    <903>   DW_AT_decl_file   : 4
    <904>   DW_AT_decl_line   : 351
    <906>   DW_AT_decl_column : 17
    <907>   DW_AT_type        : <0x8bd>
    <90b>   DW_AT_data_member_location: 16
 <2><90c>: Abbrev Number: 4 (DW_TAG_member)
    <90d>   DW_AT_name        : FCR
    <911>   DW_AT_decl_file   : 4
    <911>   DW_AT_decl_line   : 352
    <913>   DW_AT_decl_column : 17
    <913>   DW_AT_type        : <0x8bd>
    <917>   DW_AT_data_member_location: 20
 <2><918>: Abbrev Number: 0
 <1><919>: Abbrev Number: 7 (DW_TAG_typedef)
    <91a>   DW_AT_name        : (indirect string, offset: 0xb0f28): DMA_Stream_TypeDef
    <91e>   DW_AT_decl_file   : 4
    <91f>   DW_AT_decl_line   : 353
    <921>   DW_AT_decl_column : 3
    <921>   DW_AT_type        : <0x8c2>
 <1><925>: Abbrev Number: 12 (DW_TAG_structure_type)
    <926>   DW_AT_byte_size   : 84
    <927>   DW_AT_decl_file   : 4
    <928>   DW_AT_decl_line   : 728
    <92a>   DW_AT_decl_column : 9
    <92a>   DW_AT_sibling     : <0xa3f>
 <2><92e>: Abbrev Number: 4 (DW_TAG_member)
    <92f>   DW_AT_name        : CR1
    <933>   DW_AT_decl_file   : 4
    <933>   DW_AT_decl_line   : 730
    <935>   DW_AT_decl_column : 17
    <935>   DW_AT_type        : <0x8bd>
    <939>   DW_AT_data_member_location: 0
 <2><93a>: Abbrev Number: 4 (DW_TAG_member)
    <93b>   DW_AT_name        : CR2
    <93f>   DW_AT_decl_file   : 4
    <93f>   DW_AT_decl_line   : 731
    <941>   DW_AT_decl_column : 17
    <941>   DW_AT_type        : <0x8bd>
    <945>   DW_AT_data_member_location: 4
 <2><946>: Abbrev Number: 3 (DW_TAG_member)
    <947>   DW_AT_name        : (indirect string, offset: 0x39a86): SMCR
    <94b>   DW_AT_decl_file   : 4
    <94c>   DW_AT_decl_line   : 732
    <94e>   DW_AT_decl_column : 17
    <94f>   DW_AT_type        : <0x8bd>
    <953>   DW_AT_data_member_location: 8
 <2><954>: Abbrev Number: 3 (DW_TAG_member)
    <955>   DW_AT_name        : (indirect string, offset: 0x3f8a0): DIER
    <959>   DW_AT_decl_file   : 4
    <95a>   DW_AT_decl_line   : 733
    <95c>   DW_AT_decl_column : 17
    <95d>   DW_AT_type        : <0x8bd>
    <961>   DW_AT_data_member_location: 12
 <2><962>: Abbrev Number: 4 (DW_TAG_member)
    <963>   DW_AT_name        : SR
    <966>   DW_AT_decl_file   : 4
    <966>   DW_AT_decl_line   : 734
    <968>   DW_AT_decl_column : 17
    <968>   DW_AT_type        : <0x8bd>
    <96c>   DW_AT_data_member_location: 16
 <2><96d>: Abbrev Number: 4 (DW_TAG_member)
    <96e>   DW_AT_name        : EGR
    <972>   DW_AT_decl_file   : 4
    <972>   DW_AT_decl_line   : 735
    <974>   DW_AT_decl_column : 17
    <974>   DW_AT_type        : <0x8bd>
    <978>   DW_AT_data_member_location: 20
 <2><979>: Abbrev Number: 3 (DW_TAG_member)
    <97a>   DW_AT_name        : (indirect string, offset: 0xb1cc0): CCMR1
    <97e>   DW_AT_decl_file   : 4
    <97f>   DW_AT_decl_line   : 736
    <981>   DW_AT_decl_column : 17
    <982>   DW_AT_type        : <0x8bd>
    <986>   DW_AT_data_member_location: 24
 <2><987>: Abbrev Number: 3 (DW_TAG_member)
    <988>   DW_AT_name        : (indirect string, offset: 0x4e01d): CCMR2
    <98c>   DW_AT_decl_file   : 4
    <98d>   DW_AT_decl_line   : 737
    <98f>   DW_AT_decl_column : 17
    <990>   DW_AT_type        : <0x8bd>
    <994>   DW_AT_data_member_location: 28
 <2><995>: Abbrev Number: 3 (DW_TAG_member)
    <996>   DW_AT_name        : (indirect string, offset: 0x2fe78): CCER
    <99a>   DW_AT_decl_file   : 4
    <99b>   DW_AT_decl_line   : 738
    <99d>   DW_AT_decl_column : 17
    <99e>   DW_AT_type        : <0x8bd>
    <9a2>   DW_AT_data_member_location: 32
 <2><9a3>: Abbrev Number: 4 (DW_TAG_member)
    <9a4>   DW_AT_name        : CNT
    <9a8>   DW_AT_decl_file   : 4
    <9a8>   DW_AT_decl_line   : 739
    <9aa>   DW_AT_decl_column : 17
    <9aa>   DW_AT_type        : <0x8bd>
    <9ae>   DW_AT_data_member_location: 36
 <2><9af>: Abbrev Number: 4 (DW_TAG_member)
    <9b0>   DW_AT_name        : PSC
    <9b4>   DW_AT_decl_file   : 4
    <9b4>   DW_AT_decl_line   : 740
    <9b6>   DW_AT_decl_column : 17
    <9b6>   DW_AT_type        : <0x8bd>
    <9ba>   DW_AT_data_member_location: 40
 <2><9bb>: Abbrev Number: 4 (DW_TAG_member)
    <9bc>   DW_AT_name        : ARR
    <9c0>   DW_AT_decl_file   : 4
    <9c0>   DW_AT_decl_line   : 741
    <9c2>   DW_AT_decl_column : 17
    <9c2>   DW_AT_type        : <0x8bd>
    <9c6>   DW_AT_data_member_location: 44
 <2><9c7>: Abbrev Number: 4 (DW_TAG_member)
    <9c8>   DW_AT_name        : RCR
    <9cc>   DW_AT_decl_file   : 4
    <9cc>   DW_AT_decl_line   : 742
    <9ce>   DW_AT_decl_column : 17
    <9ce>   DW_AT_type        : <0x8bd>
    <9d2>   DW_AT_data_member_location: 48
 <2><9d3>: Abbrev Number: 3 (DW_TAG_member)
    <9d4>   DW_AT_name        : (indirect string, offset: 0x16d38): CCR1
    <9d8>   DW_AT_decl_file   : 4
    <9d9>   DW_AT_decl_line   : 743
    <9db>   DW_AT_decl_column : 17
    <9dc>   DW_AT_type        : <0x8bd>
    <9e0>   DW_AT_data_member_location: 52
 <2><9e1>: Abbrev Number: 3 (DW_TAG_member)
    <9e2>   DW_AT_name        : (indirect string, offset: 0x51d7d): CCR2
    <9e6>   DW_AT_decl_file   : 4
    <9e7>   DW_AT_decl_line   : 744
    <9e9>   DW_AT_decl_column : 17
    <9ea>   DW_AT_type        : <0x8bd>
    <9ee>   DW_AT_data_member_location: 56
 <2><9ef>: Abbrev Number: 3 (DW_TAG_member)
    <9f0>   DW_AT_name        : (indirect string, offset: 0x94b63): CCR3
    <9f4>   DW_AT_decl_file   : 4
    <9f5>   DW_AT_decl_line   : 745
    <9f7>   DW_AT_decl_column : 17
    <9f8>   DW_AT_type        : <0x8bd>
    <9fc>   DW_AT_data_member_location: 60
 <2><9fd>: Abbrev Number: 3 (DW_TAG_member)
    <9fe>   DW_AT_name        : (indirect string, offset: 0xbfdd): CCR4
    <a02>   DW_AT_decl_file   : 4
    <a03>   DW_AT_decl_line   : 746
    <a05>   DW_AT_decl_column : 17
    <a06>   DW_AT_type        : <0x8bd>
    <a0a>   DW_AT_data_member_location: 64
 <2><a0b>: Abbrev Number: 3 (DW_TAG_member)
    <a0c>   DW_AT_name        : (indirect string, offset: 0x84b71): BDTR
    <a10>   DW_AT_decl_file   : 4
    <a11>   DW_AT_decl_line   : 747
    <a13>   DW_AT_decl_column : 17
    <a14>   DW_AT_type        : <0x8bd>
    <a18>   DW_AT_data_member_location: 68
 <2><a19>: Abbrev Number: 4 (DW_TAG_member)
    <a1a>   DW_AT_name        : DCR
    <a1e>   DW_AT_decl_file   : 4
    <a1e>   DW_AT_decl_line   : 748
    <a20>   DW_AT_decl_column : 17
    <a20>   DW_AT_type        : <0x8bd>
    <a24>   DW_AT_data_member_location: 72
 <2><a25>: Abbrev Number: 3 (DW_TAG_member)
    <a26>   DW_AT_name        : (indirect string, offset: 0xa7531): DMAR
    <a2a>   DW_AT_decl_file   : 4
    <a2b>   DW_AT_decl_line   : 749
    <a2d>   DW_AT_decl_column : 17
    <a2e>   DW_AT_type        : <0x8bd>
    <a32>   DW_AT_data_member_location: 76
 <2><a33>: Abbrev Number: 4 (DW_TAG_member)
    <a34>   DW_AT_name        : OR
    <a37>   DW_AT_decl_file   : 4
    <a37>   DW_AT_decl_line   : 750
    <a39>   DW_AT_decl_column : 17
    <a39>   DW_AT_type        : <0x8bd>
    <a3d>   DW_AT_data_member_location: 80
 <2><a3e>: Abbrev Number: 0
 <1><a3f>: Abbrev Number: 7 (DW_TAG_typedef)
    <a40>   DW_AT_name        : (indirect string, offset: 0xb8939): TIM_TypeDef
    <a44>   DW_AT_decl_file   : 4
    <a45>   DW_AT_decl_line   : 751
    <a47>   DW_AT_decl_column : 3
    <a47>   DW_AT_type        : <0x925>
 <1><a4b>: Abbrev Number: 6 (DW_TAG_base_type)
    <a4c>   DW_AT_byte_size   : 8
    <a4d>   DW_AT_encoding    : 4	(float)
    <a4e>   DW_AT_name        : (indirect string, offset: 0xc3f49): long double
 <1><a52>: Abbrev Number: 13 (DW_TAG_enumeration_type)
    <a53>   DW_AT_encoding    : 7	(unsigned)
    <a53>   DW_AT_byte_size   : 1
    <a53>   DW_AT_type        : <0x842>
    <a57>   DW_AT_decl_file   : 5
    <a58>   DW_AT_decl_line   : 50
    <a59>   DW_AT_decl_column : 1
    <a59>   DW_AT_sibling     : <0xa6a>
 <2><a5d>: Abbrev Number: 2 (DW_TAG_enumerator)
    <a5e>   DW_AT_name        : (indirect string, offset: 0x8fe34): HAL_UNLOCKED
    <a62>   DW_AT_const_value : 0
 <2><a63>: Abbrev Number: 2 (DW_TAG_enumerator)
    <a64>   DW_AT_name        : (indirect string, offset: 0xc2c41): HAL_LOCKED
    <a68>   DW_AT_const_value : 1
 <2><a69>: Abbrev Number: 0
 <1><a6a>: Abbrev Number: 5 (DW_TAG_typedef)
    <a6b>   DW_AT_name        : (indirect string, offset: 0x735de): HAL_LockTypeDef
    <a6f>   DW_AT_decl_file   : 5
    <a70>   DW_AT_decl_line   : 53
    <a71>   DW_AT_decl_column : 3
    <a72>   DW_AT_type        : <0xa52>
 <1><a76>: Abbrev Number: 14 (DW_TAG_structure_type)
    <a77>   DW_AT_byte_size   : 48
    <a78>   DW_AT_decl_file   : 6
    <a79>   DW_AT_decl_line   : 48
    <a7a>   DW_AT_decl_column : 9
    <a7a>   DW_AT_sibling     : <0xb1b>
 <2><a7e>: Abbrev Number: 1 (DW_TAG_member)
    <a7f>   DW_AT_name        : (indirect string, offset: 0x657af): Channel
    <a83>   DW_AT_decl_file   : 6
    <a84>   DW_AT_decl_line   : 50
    <a85>   DW_AT_decl_column : 12
    <a86>   DW_AT_type        : <0x8b1>
    <a8a>   DW_AT_data_member_location: 0
 <2><a8b>: Abbrev Number: 1 (DW_TAG_member)
    <a8c>   DW_AT_name        : (indirect string, offset: 0xcffc1): Direction
    <a90>   DW_AT_decl_file   : 6
    <a91>   DW_AT_decl_line   : 53
    <a92>   DW_AT_decl_column : 12
    <a93>   DW_AT_type        : <0x8b1>
    <a97>   DW_AT_data_member_location: 4
 <2><a98>: Abbrev Number: 1 (DW_TAG_member)
    <a99>   DW_AT_name        : (indirect string, offset: 0xcac0): PeriphInc
    <a9d>   DW_AT_decl_file   : 6
    <a9e>   DW_AT_decl_line   : 57
    <a9f>   DW_AT_decl_column : 12
    <aa0>   DW_AT_type        : <0x8b1>
    <aa4>   DW_AT_data_member_location: 8
 <2><aa5>: Abbrev Number: 1 (DW_TAG_member)
    <aa6>   DW_AT_name        : (indirect string, offset: 0x1e859): MemInc
    <aaa>   DW_AT_decl_file   : 6
    <aab>   DW_AT_decl_line   : 60
    <aac>   DW_AT_decl_column : 12
    <aad>   DW_AT_type        : <0x8b1>
    <ab1>   DW_AT_data_member_location: 12
 <2><ab2>: Abbrev Number: 1 (DW_TAG_member)
    <ab3>   DW_AT_name        : (indirect string, offset: 0x60efa): PeriphDataAlignment
    <ab7>   DW_AT_decl_file   : 6
    <ab8>   DW_AT_decl_line   : 63
    <ab9>   DW_AT_decl_column : 12
    <aba>   DW_AT_type        : <0x8b1>
    <abe>   DW_AT_data_member_location: 16
 <2><abf>: Abbrev Number: 1 (DW_TAG_member)
    <ac0>   DW_AT_name        : (indirect string, offset: 0xb0447): MemDataAlignment
    <ac4>   DW_AT_decl_file   : 6
    <ac5>   DW_AT_decl_line   : 66
    <ac6>   DW_AT_decl_column : 12
    <ac7>   DW_AT_type        : <0x8b1>
    <acb>   DW_AT_data_member_location: 20
 <2><acc>: Abbrev Number: 1 (DW_TAG_member)
    <acd>   DW_AT_name        : (indirect string, offset: 0xcc242): Mode
    <ad1>   DW_AT_decl_file   : 6
    <ad2>   DW_AT_decl_line   : 69
    <ad3>   DW_AT_decl_column : 12
    <ad4>   DW_AT_type        : <0x8b1>
    <ad8>   DW_AT_data_member_location: 24
 <2><ad9>: Abbrev Number: 1 (DW_TAG_member)
    <ada>   DW_AT_name        : (indirect string, offset: 0xcf54a): Priority
    <ade>   DW_AT_decl_file   : 6
    <adf>   DW_AT_decl_line   : 74
    <ae0>   DW_AT_decl_column : 12
    <ae1>   DW_AT_type        : <0x8b1>
    <ae5>   DW_AT_data_member_location: 28
 <2><ae6>: Abbrev Number: 1 (DW_TAG_member)
    <ae7>   DW_AT_name        : (indirect string, offset: 0x542b7): FIFOMode
    <aeb>   DW_AT_decl_file   : 6
    <aec>   DW_AT_decl_line   : 77
    <aed>   DW_AT_decl_column : 12
    <aee>   DW_AT_type        : <0x8b1>
    <af2>   DW_AT_data_member_location: 32
 <2><af3>: Abbrev Number: 1 (DW_TAG_member)
    <af4>   DW_AT_name        : (indirect string, offset: 0x94113): FIFOThreshold
    <af8>   DW_AT_decl_file   : 6
    <af9>   DW_AT_decl_line   : 82
    <afa>   DW_AT_decl_column : 12
    <afb>   DW_AT_type        : <0x8b1>
    <aff>   DW_AT_data_member_location: 36
 <2><b00>: Abbrev Number: 1 (DW_TAG_member)
    <b01>   DW_AT_name        : (indirect string, offset: 0x923b6): MemBurst
    <b05>   DW_AT_decl_file   : 6
    <b06>   DW_AT_decl_line   : 85
    <b07>   DW_AT_decl_column : 12
    <b08>   DW_AT_type        : <0x8b1>
    <b0c>   DW_AT_data_member_location: 40
 <2><b0d>: Abbrev Number: 1 (DW_TAG_member)
    <b0e>   DW_AT_name        : (indirect string, offset: 0x43076): PeriphBurst
    <b12>   DW_AT_decl_file   : 6
    <b13>   DW_AT_decl_line   : 91
    <b14>   DW_AT_decl_column : 12
    <b15>   DW_AT_type        : <0x8b1>
    <b19>   DW_AT_data_member_location: 44
 <2><b1a>: Abbrev Number: 0
 <1><b1b>: Abbrev Number: 5 (DW_TAG_typedef)
    <b1c>   DW_AT_name        : (indirect string, offset: 0x34dbe): DMA_InitTypeDef
    <b20>   DW_AT_decl_file   : 6
    <b21>   DW_AT_decl_line   : 96
    <b22>   DW_AT_decl_column : 2
    <b23>   DW_AT_type        : <0xa76>
 <1><b27>: Abbrev Number: 13 (DW_TAG_enumeration_type)
    <b28>   DW_AT_encoding    : 7	(unsigned)
    <b28>   DW_AT_byte_size   : 1
    <b28>   DW_AT_type        : <0x842>
    <b2c>   DW_AT_decl_file   : 6
    <b2d>   DW_AT_decl_line   : 103
    <b2e>   DW_AT_decl_column : 1
    <b2e>   DW_AT_sibling     : <0xb57>
 <2><b32>: Abbrev Number: 2 (DW_TAG_enumerator)
    <b33>   DW_AT_name        : (indirect string, offset: 0xc5fe): HAL_DMA_STATE_RESET
    <b37>   DW_AT_const_value : 0
 <2><b38>: Abbrev Number: 2 (DW_TAG_enumerator)
    <b39>   DW_AT_name        : (indirect string, offset: 0x360f8): HAL_DMA_STATE_READY
    <b3d>   DW_AT_const_value : 1
 <2><b3e>: Abbrev Number: 2 (DW_TAG_enumerator)
    <b3f>   DW_AT_name        : (indirect string, offset: 0x8678d): HAL_DMA_STATE_BUSY
    <b43>   DW_AT_const_value : 2
 <2><b44>: Abbrev Number: 2 (DW_TAG_enumerator)
    <b45>   DW_AT_name        : (indirect string, offset: 0xbfc4a): HAL_DMA_STATE_TIMEOUT
    <b49>   DW_AT_const_value : 3
 <2><b4a>: Abbrev Number: 2 (DW_TAG_enumerator)
    <b4b>   DW_AT_name        : (indirect string, offset: 0x93b92): HAL_DMA_STATE_ERROR
    <b4f>   DW_AT_const_value : 4
 <2><b50>: Abbrev Number: 2 (DW_TAG_enumerator)
    <b51>   DW_AT_name        : (indirect string, offset: 0x4c77e): HAL_DMA_STATE_ABORT
    <b55>   DW_AT_const_value : 5
 <2><b56>: Abbrev Number: 0
 <1><b57>: Abbrev Number: 5 (DW_TAG_typedef)
    <b58>   DW_AT_name        : (indirect string, offset: 0xaf79a): HAL_DMA_StateTypeDef
    <b5c>   DW_AT_decl_file   : 6
    <b5d>   DW_AT_decl_line   : 110
    <b5e>   DW_AT_decl_column : 2
    <b5f>   DW_AT_type        : <0xb27>
 <1><b63>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <b64>   DW_AT_type        : <0xb57>
 <1><b68>: Abbrev Number: 15 (DW_TAG_structure_type)
    <b69>   DW_AT_name        : (indirect string, offset: 0xa5b81): __DMA_HandleTypeDef
    <b6d>   DW_AT_byte_size   : 96
    <b6e>   DW_AT_decl_file   : 6
    <b6f>   DW_AT_decl_line   : 138
    <b70>   DW_AT_decl_column : 16
    <b70>   DW_AT_sibling     : <0xc2b>
 <2><b74>: Abbrev Number: 1 (DW_TAG_member)
    <b75>   DW_AT_name        : (indirect string, offset: 0xbc869): Instance
    <b79>   DW_AT_decl_file   : 6
    <b7a>   DW_AT_decl_line   : 140
    <b7b>   DW_AT_decl_column : 31
    <b7c>   DW_AT_type        : <0xc2b>
    <b80>   DW_AT_data_member_location: 0
 <2><b81>: Abbrev Number: 1 (DW_TAG_member)
    <b82>   DW_AT_name        : (indirect string, offset: 0xcc279): Init
    <b86>   DW_AT_decl_file   : 6
    <b87>   DW_AT_decl_line   : 142
    <b88>   DW_AT_decl_column : 30
    <b89>   DW_AT_type        : <0xb1b>
    <b8d>   DW_AT_data_member_location: 4
 <2><b8e>: Abbrev Number: 1 (DW_TAG_member)
    <b8f>   DW_AT_name        : (indirect string, offset: 0x8aa74): Lock
    <b93>   DW_AT_decl_file   : 6
    <b94>   DW_AT_decl_line   : 144
    <b95>   DW_AT_decl_column : 30
    <b96>   DW_AT_type        : <0xa6a>
    <b9a>   DW_AT_data_member_location: 52
 <2><b9b>: Abbrev Number: 1 (DW_TAG_member)
    <b9c>   DW_AT_name        : (indirect string, offset: 0xcd2bf): State
    <ba0>   DW_AT_decl_file   : 6
    <ba1>   DW_AT_decl_line   : 146
    <ba2>   DW_AT_decl_column : 30
    <ba3>   DW_AT_type        : <0xb63>
    <ba7>   DW_AT_data_member_location: 53
 <2><ba8>: Abbrev Number: 1 (DW_TAG_member)
    <ba9>   DW_AT_name        : (indirect string, offset: 0xb9761): Parent
    <bad>   DW_AT_decl_file   : 6
    <bae>   DW_AT_decl_line   : 148
    <baf>   DW_AT_decl_column : 31
    <bb0>   DW_AT_type        : <0xc30>
    <bb4>   DW_AT_data_member_location: 56
 <2><bb5>: Abbrev Number: 1 (DW_TAG_member)
    <bb6>   DW_AT_name        : (indirect string, offset: 0xc216c): XferCpltCallback
    <bba>   DW_AT_decl_file   : 6
    <bbb>   DW_AT_decl_line   : 150
    <bbc>   DW_AT_decl_column : 33
    <bbd>   DW_AT_type        : <0xc42>
    <bc1>   DW_AT_data_member_location: 60
 <2><bc2>: Abbrev Number: 1 (DW_TAG_member)
    <bc3>   DW_AT_name        : (indirect string, offset: 0x97725): XferHalfCpltCallback
    <bc7>   DW_AT_decl_file   : 6
    <bc8>   DW_AT_decl_line   : 152
    <bc9>   DW_AT_decl_column : 33
    <bca>   DW_AT_type        : <0xc42>
    <bce>   DW_AT_data_member_location: 64
 <2><bcf>: Abbrev Number: 1 (DW_TAG_member)
    <bd0>   DW_AT_name        : (indirect string, offset: 0x72b99): XferM1CpltCallback
    <bd4>   DW_AT_decl_file   : 6
    <bd5>   DW_AT_decl_line   : 154
    <bd6>   DW_AT_decl_column : 33
    <bd7>   DW_AT_type        : <0xc42>
    <bdb>   DW_AT_data_member_location: 68
 <2><bdc>: Abbrev Number: 1 (DW_TAG_member)
    <bdd>   DW_AT_name        : (indirect string, offset: 0x5de38): XferM1HalfCpltCallback
    <be1>   DW_AT_decl_file   : 6
    <be2>   DW_AT_decl_line   : 156
    <be3>   DW_AT_decl_column : 33
    <be4>   DW_AT_type        : <0xc42>
    <be8>   DW_AT_data_member_location: 72
 <2><be9>: Abbrev Number: 1 (DW_TAG_member)
    <bea>   DW_AT_name        : (indirect string, offset: 0x1c177): XferErrorCallback
    <bee>   DW_AT_decl_file   : 6
    <bef>   DW_AT_decl_line   : 158
    <bf0>   DW_AT_decl_column : 33
    <bf1>   DW_AT_type        : <0xc42>
    <bf5>   DW_AT_data_member_location: 76
 <2><bf6>: Abbrev Number: 1 (DW_TAG_member)
    <bf7>   DW_AT_name        : (indirect string, offset: 0xb5fb5): XferAbortCallback
    <bfb>   DW_AT_decl_file   : 6
    <bfc>   DW_AT_decl_line   : 160
    <bfd>   DW_AT_decl_column : 33
    <bfe>   DW_AT_type        : <0xc42>
    <c02>   DW_AT_data_member_location: 80
 <2><c03>: Abbrev Number: 1 (DW_TAG_member)
    <c04>   DW_AT_name        : (indirect string, offset: 0xbe9bd): ErrorCode
    <c08>   DW_AT_decl_file   : 6
    <c09>   DW_AT_decl_line   : 162
    <c0a>   DW_AT_decl_column : 30
    <c0b>   DW_AT_type        : <0x8bd>
    <c0f>   DW_AT_data_member_location: 84
 <2><c10>: Abbrev Number: 1 (DW_TAG_member)
    <c11>   DW_AT_name        : (indirect string, offset: 0x573b8): StreamBaseAddress
    <c15>   DW_AT_decl_file   : 6
    <c16>   DW_AT_decl_line   : 164
    <c17>   DW_AT_decl_column : 30
    <c18>   DW_AT_type        : <0x8b1>
    <c1c>   DW_AT_data_member_location: 88
 <2><c1d>: Abbrev Number: 1 (DW_TAG_member)
    <c1e>   DW_AT_name        : (indirect string, offset: 0xa3c94): StreamIndex
    <c22>   DW_AT_decl_file   : 6
    <c23>   DW_AT_decl_line   : 166
    <c24>   DW_AT_decl_column : 30
    <c25>   DW_AT_type        : <0x8b1>
    <c29>   DW_AT_data_member_location: 92
 <2><c2a>: Abbrev Number: 0
 <1><c2b>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <c2c>   DW_AT_byte_size   : 4
    <c2c>   DW_AT_type        : <0x919>
 <1><c30>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <c31>   DW_AT_byte_size   : 4
 <1><c32>: Abbrev Number: 22 (DW_TAG_subroutine_type)
    <c33>   DW_AT_prototyped  : 1
    <c33>   DW_AT_sibling     : <0xc3d>
 <2><c37>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <c38>   DW_AT_type        : <0xc3d>
 <2><c3c>: Abbrev Number: 0
 <1><c3d>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <c3e>   DW_AT_byte_size   : 4
    <c3e>   DW_AT_type        : <0xb68>
 <1><c42>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <c43>   DW_AT_byte_size   : 4
    <c43>   DW_AT_type        : <0xc32>
 <1><c47>: Abbrev Number: 5 (DW_TAG_typedef)
    <c48>   DW_AT_name        : (indirect string, offset: 0xa5b83): DMA_HandleTypeDef
    <c4c>   DW_AT_decl_file   : 6
    <c4d>   DW_AT_decl_line   : 168
    <c4e>   DW_AT_decl_column : 2
    <c4f>   DW_AT_type        : <0xb68>
 <1><c53>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <c54>   DW_AT_byte_size   : 4
    <c54>   DW_AT_type        : <0xc47>
 <1><c58>: Abbrev Number: 14 (DW_TAG_structure_type)
    <c59>   DW_AT_byte_size   : 24
    <c5a>   DW_AT_decl_file   : 7
    <c5b>   DW_AT_decl_line   : 46
    <c5c>   DW_AT_decl_column : 9
    <c5c>   DW_AT_sibling     : <0xcaf>
 <2><c60>: Abbrev Number: 1 (DW_TAG_member)
    <c61>   DW_AT_name        : (indirect string, offset: 0xcebd3): Prescaler
    <c65>   DW_AT_decl_file   : 7
    <c66>   DW_AT_decl_line   : 48
    <c67>   DW_AT_decl_column : 12
    <c68>   DW_AT_type        : <0x8b1>
    <c6c>   DW_AT_data_member_location: 0
 <2><c6d>: Abbrev Number: 1 (DW_TAG_member)
    <c6e>   DW_AT_name        : (indirect string, offset: 0xb10c3): CounterMode
    <c72>   DW_AT_decl_file   : 7
    <c73>   DW_AT_decl_line   : 51
    <c74>   DW_AT_decl_column : 12
    <c75>   DW_AT_type        : <0x8b1>
    <c79>   DW_AT_data_member_location: 4
 <2><c7a>: Abbrev Number: 1 (DW_TAG_member)
    <c7b>   DW_AT_name        : (indirect string, offset: 0x97f4a): Period
    <c7f>   DW_AT_decl_file   : 7
    <c80>   DW_AT_decl_line   : 54
    <c81>   DW_AT_decl_column : 12
    <c82>   DW_AT_type        : <0x8b1>
    <c86>   DW_AT_data_member_location: 8
 <2><c87>: Abbrev Number: 1 (DW_TAG_member)
    <c88>   DW_AT_name        : (indirect string, offset: 0x4f67d): ClockDivision
    <c8c>   DW_AT_decl_file   : 7
    <c8d>   DW_AT_decl_line   : 58
    <c8e>   DW_AT_decl_column : 12
    <c8f>   DW_AT_type        : <0x8b1>
    <c93>   DW_AT_data_member_location: 12
 <2><c94>: Abbrev Number: 1 (DW_TAG_member)
    <c95>   DW_AT_name        : (indirect string, offset: 0x87eff): RepetitionCounter
    <c99>   DW_AT_decl_file   : 7
    <c9a>   DW_AT_decl_line   : 61
    <c9b>   DW_AT_decl_column : 12
    <c9c>   DW_AT_type        : <0x8b1>
    <ca0>   DW_AT_data_member_location: 16
 <2><ca1>: Abbrev Number: 1 (DW_TAG_member)
    <ca2>   DW_AT_name        : (indirect string, offset: 0xb3ce0): AutoReloadPreload
    <ca6>   DW_AT_decl_file   : 7
    <ca7>   DW_AT_decl_line   : 72
    <ca8>   DW_AT_decl_column : 12
    <ca9>   DW_AT_type        : <0x8b1>
    <cad>   DW_AT_data_member_location: 20
 <2><cae>: Abbrev Number: 0
 <1><caf>: Abbrev Number: 5 (DW_TAG_typedef)
    <cb0>   DW_AT_name        : (indirect string, offset: 0x4399c): TIM_Base_InitTypeDef
    <cb4>   DW_AT_decl_file   : 7
    <cb5>   DW_AT_decl_line   : 74
    <cb6>   DW_AT_decl_column : 3
    <cb7>   DW_AT_type        : <0xc58>
 <1><cbb>: Abbrev Number: 11 (DW_TAG_enumeration_type)
    <cbc>   DW_AT_encoding    : 7	(unsigned)
    <cbc>   DW_AT_byte_size   : 1
    <cbc>   DW_AT_type        : <0x842>
    <cc0>   DW_AT_decl_file   : 7
    <cc0>   DW_AT_decl_line   : 291
    <cc2>   DW_AT_decl_column : 1
    <cc2>   DW_AT_sibling     : <0xce5>
 <2><cc6>: Abbrev Number: 2 (DW_TAG_enumerator)
    <cc7>   DW_AT_name        : (indirect string, offset: 0x7a5df): HAL_TIM_STATE_RESET
    <ccb>   DW_AT_const_value : 0
 <2><ccc>: Abbrev Number: 2 (DW_TAG_enumerator)
    <ccd>   DW_AT_name        : (indirect string, offset: 0x6c48): HAL_TIM_STATE_READY
    <cd1>   DW_AT_const_value : 1
 <2><cd2>: Abbrev Number: 2 (DW_TAG_enumerator)
    <cd3>   DW_AT_name        : (indirect string, offset: 0x31997): HAL_TIM_STATE_BUSY
    <cd7>   DW_AT_const_value : 2
 <2><cd8>: Abbrev Number: 2 (DW_TAG_enumerator)
    <cd9>   DW_AT_name        : (indirect string, offset: 0xa2dd7): HAL_TIM_STATE_TIMEOUT
    <cdd>   DW_AT_const_value : 3
 <2><cde>: Abbrev Number: 2 (DW_TAG_enumerator)
    <cdf>   DW_AT_name        : (indirect string, offset: 0x78836): HAL_TIM_STATE_ERROR
    <ce3>   DW_AT_const_value : 4
 <2><ce4>: Abbrev Number: 0
 <1><ce5>: Abbrev Number: 7 (DW_TAG_typedef)
    <ce6>   DW_AT_name        : (indirect string, offset: 0x7fe31): HAL_TIM_StateTypeDef
    <cea>   DW_AT_decl_file   : 7
    <ceb>   DW_AT_decl_line   : 297
    <ced>   DW_AT_decl_column : 3
    <ced>   DW_AT_type        : <0xcbb>
 <1><cf1>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <cf2>   DW_AT_type        : <0xce5>
 <1><cf6>: Abbrev Number: 11 (DW_TAG_enumeration_type)
    <cf7>   DW_AT_encoding    : 7	(unsigned)
    <cf7>   DW_AT_byte_size   : 1
    <cf7>   DW_AT_type        : <0x842>
    <cfb>   DW_AT_decl_file   : 7
    <cfb>   DW_AT_decl_line   : 303
    <cfd>   DW_AT_decl_column : 1
    <cfd>   DW_AT_sibling     : <0xd14>
 <2><d01>: Abbrev Number: 2 (DW_TAG_enumerator)
    <d02>   DW_AT_name        : (indirect string, offset: 0x8939b): HAL_TIM_CHANNEL_STATE_RESET
    <d06>   DW_AT_const_value : 0
 <2><d07>: Abbrev Number: 2 (DW_TAG_enumerator)
    <d08>   DW_AT_name        : (indirect string, offset: 0x72e97): HAL_TIM_CHANNEL_STATE_READY
    <d0c>   DW_AT_const_value : 1
 <2><d0d>: Abbrev Number: 2 (DW_TAG_enumerator)
    <d0e>   DW_AT_name        : (indirect string, offset: 0x5e04f): HAL_TIM_CHANNEL_STATE_BUSY
    <d12>   DW_AT_const_value : 2
 <2><d13>: Abbrev Number: 0
 <1><d14>: Abbrev Number: 7 (DW_TAG_typedef)
    <d15>   DW_AT_name        : (indirect string, offset: 0x294e4): HAL_TIM_ChannelStateTypeDef
    <d19>   DW_AT_decl_file   : 7
    <d1a>   DW_AT_decl_line   : 307
    <d1c>   DW_AT_decl_column : 3
    <d1c>   DW_AT_type        : <0xcf6>
 <1><d20>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <d21>   DW_AT_type        : <0xd14>
 <1><d25>: Abbrev Number: 11 (DW_TAG_enumeration_type)
    <d26>   DW_AT_encoding    : 7	(unsigned)
    <d26>   DW_AT_byte_size   : 1
    <d26>   DW_AT_type        : <0x842>
    <d2a>   DW_AT_decl_file   : 7
    <d2a>   DW_AT_decl_line   : 313
    <d2c>   DW_AT_decl_column : 1
    <d2c>   DW_AT_sibling     : <0xd43>
 <2><d30>: Abbrev Number: 2 (DW_TAG_enumerator)
    <d31>   DW_AT_name        : (indirect string, offset: 0x3e2c): HAL_DMA_BURST_STATE_RESET
    <d35>   DW_AT_const_value : 0
 <2><d36>: Abbrev Number: 2 (DW_TAG_enumerator)
    <d37>   DW_AT_name        : (indirect string, offset: 0x6bb2f): HAL_DMA_BURST_STATE_READY
    <d3b>   DW_AT_const_value : 1
 <2><d3c>: Abbrev Number: 2 (DW_TAG_enumerator)
    <d3d>   DW_AT_name        : (indirect string, offset: 0x421b4): HAL_DMA_BURST_STATE_BUSY
    <d41>   DW_AT_const_value : 2
 <2><d42>: Abbrev Number: 0
 <1><d43>: Abbrev Number: 7 (DW_TAG_typedef)
    <d44>   DW_AT_name        : (indirect string, offset: 0x1a777): HAL_TIM_DMABurstStateTypeDef
    <d48>   DW_AT_decl_file   : 7
    <d49>   DW_AT_decl_line   : 317
    <d4b>   DW_AT_decl_column : 3
    <d4b>   DW_AT_type        : <0xd25>
 <1><d4f>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <d50>   DW_AT_type        : <0xd43>
 <1><d54>: Abbrev Number: 11 (DW_TAG_enumeration_type)
    <d55>   DW_AT_encoding    : 7	(unsigned)
    <d55>   DW_AT_byte_size   : 1
    <d55>   DW_AT_type        : <0x842>
    <d59>   DW_AT_decl_file   : 7
    <d59>   DW_AT_decl_line   : 323
    <d5b>   DW_AT_decl_column : 1
    <d5b>   DW_AT_sibling     : <0xd7e>
 <2><d5f>: Abbrev Number: 2 (DW_TAG_enumerator)
    <d60>   DW_AT_name        : (indirect string, offset: 0x6db5e): HAL_TIM_ACTIVE_CHANNEL_1
    <d64>   DW_AT_const_value : 1
 <2><d65>: Abbrev Number: 2 (DW_TAG_enumerator)
    <d66>   DW_AT_name        : (indirect string, offset: 0x6db77): HAL_TIM_ACTIVE_CHANNEL_2
    <d6a>   DW_AT_const_value : 2
 <2><d6b>: Abbrev Number: 2 (DW_TAG_enumerator)
    <d6c>   DW_AT_name        : (indirect string, offset: 0x6db90): HAL_TIM_ACTIVE_CHANNEL_3
    <d70>   DW_AT_const_value : 4
 <2><d71>: Abbrev Number: 2 (DW_TAG_enumerator)
    <d72>   DW_AT_name        : (indirect string, offset: 0x6dba9): HAL_TIM_ACTIVE_CHANNEL_4
    <d76>   DW_AT_const_value : 8
 <2><d77>: Abbrev Number: 2 (DW_TAG_enumerator)
    <d78>   DW_AT_name        : (indirect string, offset: 0x507fd): HAL_TIM_ACTIVE_CHANNEL_CLEARED
    <d7c>   DW_AT_const_value : 0
 <2><d7d>: Abbrev Number: 0
 <1><d7e>: Abbrev Number: 7 (DW_TAG_typedef)
    <d7f>   DW_AT_name        : (indirect string, offset: 0x657a1): HAL_TIM_ActiveChannel
    <d83>   DW_AT_decl_file   : 7
    <d84>   DW_AT_decl_line   : 329
    <d86>   DW_AT_decl_column : 3
    <d86>   DW_AT_type        : <0xd54>
 <1><d8a>: Abbrev Number: 12 (DW_TAG_structure_type)
    <d8b>   DW_AT_byte_size   : 72
    <d8c>   DW_AT_decl_file   : 7
    <d8d>   DW_AT_decl_line   : 337
    <d8f>   DW_AT_decl_column : 9
    <d8f>   DW_AT_sibling     : <0xe12>
 <2><d93>: Abbrev Number: 3 (DW_TAG_member)
    <d94>   DW_AT_name        : (indirect string, offset: 0xbc869): Instance
    <d98>   DW_AT_decl_file   : 7
    <d99>   DW_AT_decl_line   : 340
    <d9b>   DW_AT_decl_column : 39
    <d9c>   DW_AT_type        : <0xe12>
    <da0>   DW_AT_data_member_location: 0
 <2><da1>: Abbrev Number: 3 (DW_TAG_member)
    <da2>   DW_AT_name        : (indirect string, offset: 0xcc279): Init
    <da6>   DW_AT_decl_file   : 7
    <da7>   DW_AT_decl_line   : 341
    <da9>   DW_AT_decl_column : 38
    <daa>   DW_AT_type        : <0xcaf>
    <dae>   DW_AT_data_member_location: 4
 <2><daf>: Abbrev Number: 3 (DW_TAG_member)
    <db0>   DW_AT_name        : (indirect string, offset: 0x657af): Channel
    <db4>   DW_AT_decl_file   : 7
    <db5>   DW_AT_decl_line   : 342
    <db7>   DW_AT_decl_column : 38
    <db8>   DW_AT_type        : <0xd7e>
    <dbc>   DW_AT_data_member_location: 28
 <2><dbd>: Abbrev Number: 3 (DW_TAG_member)
    <dbe>   DW_AT_name        : (indirect string, offset: 0x7534b): hdma
    <dc2>   DW_AT_decl_file   : 7
    <dc3>   DW_AT_decl_line   : 343
    <dc5>   DW_AT_decl_column : 39
    <dc6>   DW_AT_type        : <0xe17>
    <dca>   DW_AT_data_member_location: 32
 <2><dcb>: Abbrev Number: 3 (DW_TAG_member)
    <dcc>   DW_AT_name        : (indirect string, offset: 0x8aa74): Lock
    <dd0>   DW_AT_decl_file   : 7
    <dd1>   DW_AT_decl_line   : 345
    <dd3>   DW_AT_decl_column : 38
    <dd4>   DW_AT_type        : <0xa6a>
    <dd8>   DW_AT_data_member_location: 60
 <2><dd9>: Abbrev Number: 3 (DW_TAG_member)
    <dda>   DW_AT_name        : (indirect string, offset: 0xcd2bf): State
    <dde>   DW_AT_decl_file   : 7
    <ddf>   DW_AT_decl_line   : 346
    <de1>   DW_AT_decl_column : 38
    <de2>   DW_AT_type        : <0xcf1>
    <de6>   DW_AT_data_member_location: 61
 <2><de7>: Abbrev Number: 3 (DW_TAG_member)
    <de8>   DW_AT_name        : (indirect string, offset: 0xd10c3): ChannelState
    <dec>   DW_AT_decl_file   : 7
    <ded>   DW_AT_decl_line   : 347
    <def>   DW_AT_decl_column : 38
    <df0>   DW_AT_type        : <0xe37>
    <df4>   DW_AT_data_member_location: 62
 <2><df5>: Abbrev Number: 3 (DW_TAG_member)
    <df6>   DW_AT_name        : (indirect string, offset: 0xd163c): ChannelNState
    <dfa>   DW_AT_decl_file   : 7
    <dfb>   DW_AT_decl_line   : 348
    <dfd>   DW_AT_decl_column : 38
    <dfe>   DW_AT_type        : <0xe37>
    <e02>   DW_AT_data_member_location: 66
 <2><e03>: Abbrev Number: 3 (DW_TAG_member)
    <e04>   DW_AT_name        : (indirect string, offset: 0xd0cf7): DMABurstState
    <e08>   DW_AT_decl_file   : 7
    <e09>   DW_AT_decl_line   : 349
    <e0b>   DW_AT_decl_column : 38
    <e0c>   DW_AT_type        : <0xd4f>
    <e10>   DW_AT_data_member_location: 70
 <2><e11>: Abbrev Number: 0
 <1><e12>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <e13>   DW_AT_byte_size   : 4
    <e13>   DW_AT_type        : <0xa3f>
 <1><e17>: Abbrev Number: 16 (DW_TAG_array_type)
    <e18>   DW_AT_type        : <0xc53>
    <e1c>   DW_AT_sibling     : <0xe27>
 <2><e20>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <e21>   DW_AT_type        : <0x892>
    <e25>   DW_AT_upper_bound : 6
 <2><e26>: Abbrev Number: 0
 <1><e27>: Abbrev Number: 16 (DW_TAG_array_type)
    <e28>   DW_AT_type        : <0xd20>
    <e2c>   DW_AT_sibling     : <0xe37>
 <2><e30>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <e31>   DW_AT_type        : <0x892>
    <e35>   DW_AT_upper_bound : 3
 <2><e36>: Abbrev Number: 0
 <1><e37>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <e38>   DW_AT_type        : <0xe27>
 <1><e3c>: Abbrev Number: 7 (DW_TAG_typedef)
    <e3d>   DW_AT_name        : (indirect string, offset: 0x4340d): TIM_HandleTypeDef
    <e41>   DW_AT_decl_file   : 7
    <e42>   DW_AT_decl_line   : 380
    <e44>   DW_AT_decl_column : 3
    <e44>   DW_AT_type        : <0xd8a>
 <1><e48>: Abbrev Number: 15 (DW_TAG_structure_type)
    <e49>   DW_AT_name        : (indirect string, offset: 0xc5602): MotorDrive
    <e4d>   DW_AT_byte_size   : 24
    <e4e>   DW_AT_decl_file   : 8
    <e4f>   DW_AT_decl_line   : 13
    <e50>   DW_AT_decl_column : 16
    <e50>   DW_AT_sibling     : <0xeae>
 <2><e54>: Abbrev Number: 1 (DW_TAG_member)
    <e55>   DW_AT_name        : (indirect string, offset: 0xc6681): htim1
    <e59>   DW_AT_decl_file   : 8
    <e5a>   DW_AT_decl_line   : 14
    <e5b>   DW_AT_decl_column : 21
    <e5c>   DW_AT_type        : <0xeae>
    <e60>   DW_AT_data_member_location: 0
 <2><e61>: Abbrev Number: 1 (DW_TAG_member)
    <e62>   DW_AT_name        : (indirect string, offset: 0xc5920): htim2
    <e66>   DW_AT_decl_file   : 8
    <e67>   DW_AT_decl_line   : 15
    <e68>   DW_AT_decl_column : 21
    <e69>   DW_AT_type        : <0xeae>
    <e6d>   DW_AT_data_member_location: 4
 <2><e6e>: Abbrev Number: 1 (DW_TAG_member)
    <e6f>   DW_AT_name        : (indirect string, offset: 0xd0da4): Input
    <e73>   DW_AT_decl_file   : 8
    <e74>   DW_AT_decl_line   : 16
    <e75>   DW_AT_decl_column : 6
    <e76>   DW_AT_type        : <0x88b>
    <e7a>   DW_AT_data_member_location: 8
 <2><e7b>: Abbrev Number: 18 (DW_TAG_member)
    <e7c>   DW_AT_name        : Dir
    <e80>   DW_AT_decl_file   : 8
    <e80>   DW_AT_decl_line   : 17
    <e81>   DW_AT_decl_column : 9
    <e82>   DW_AT_type        : <0x899>
    <e86>   DW_AT_data_member_location: 12
 <2><e87>: Abbrev Number: 18 (DW_TAG_member)
    <e88>   DW_AT_name        : Pwm
    <e8c>   DW_AT_decl_file   : 8
    <e8c>   DW_AT_decl_line   : 18
    <e8d>   DW_AT_decl_column : 11
    <e8e>   DW_AT_type        : <0x8a5>
    <e92>   DW_AT_data_member_location: 14
 <2><e93>: Abbrev Number: 1 (DW_TAG_member)
    <e94>   DW_AT_name        : (indirect string, offset: 0xc6ae4): Channel1
    <e98>   DW_AT_decl_file   : 8
    <e99>   DW_AT_decl_line   : 19
    <e9a>   DW_AT_decl_column : 15
    <e9b>   DW_AT_type        : <0x892>
    <e9f>   DW_AT_data_member_location: 16
 <2><ea0>: Abbrev Number: 1 (DW_TAG_member)
    <ea1>   DW_AT_name        : (indirect string, offset: 0xc6aed): Channel2
    <ea5>   DW_AT_decl_file   : 8
    <ea6>   DW_AT_decl_line   : 20
    <ea7>   DW_AT_decl_column : 15
    <ea8>   DW_AT_type        : <0x892>
    <eac>   DW_AT_data_member_location: 20
 <2><ead>: Abbrev Number: 0
 <1><eae>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <eaf>   DW_AT_byte_size   : 4
    <eaf>   DW_AT_type        : <0xe3c>
 <1><eb3>: Abbrev Number: 5 (DW_TAG_typedef)
    <eb4>   DW_AT_name        : (indirect string, offset: 0xc5602): MotorDrive
    <eb8>   DW_AT_decl_file   : 8
    <eb9>   DW_AT_decl_line   : 21
    <eba>   DW_AT_decl_column : 2
    <ebb>   DW_AT_type        : <0xe48>
 <1><ebf>: Abbrev Number: 6 (DW_TAG_base_type)
    <ec0>   DW_AT_byte_size   : 1
    <ec1>   DW_AT_encoding    : 8	(unsigned char)
    <ec2>   DW_AT_name        : (indirect string, offset: 0xc8364): char
 <1><ec6>: Abbrev Number: 24 (DW_TAG_subprogram)
    <ec7>   DW_AT_external    : 1
    <ec7>   DW_AT_name        : (indirect string, offset: 0x91aee): Drive
    <ecb>   DW_AT_decl_file   : 1
    <ecc>   DW_AT_decl_line   : 11
    <ecd>   DW_AT_decl_column : 6
    <ece>   DW_AT_prototyped  : 1
    <ece>   DW_AT_low_pc      : 0x80010b0
    <ed2>   DW_AT_high_pc     : 0x20c
    <ed6>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <ed8>   DW_AT_call_all_calls: 1
    <ed8>   DW_AT_sibling     : <0xf1e>
 <2><edc>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <edd>   DW_AT_name        : (indirect string, offset: 0xc6269): motor
    <ee1>   DW_AT_decl_file   : 1
    <ee1>   DW_AT_decl_line   : 11
    <ee1>   DW_AT_decl_column : 24
    <ee2>   DW_AT_type        : <0xf1e>
    <ee6>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><ee9>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <eea>   DW_AT_name        : (indirect string, offset: 0xc5920): htim2
    <eee>   DW_AT_decl_file   : 1
    <eee>   DW_AT_decl_line   : 11
    <eee>   DW_AT_decl_column : 49
    <eef>   DW_AT_type        : <0xeae>
    <ef3>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><ef6>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <ef7>   DW_AT_name        : (indirect string, offset: 0xd0da4): Input
    <efb>   DW_AT_decl_file   : 1
    <efb>   DW_AT_decl_line   : 11
    <efb>   DW_AT_decl_column : 59
    <efc>   DW_AT_type        : <0x88b>
    <f00>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><f03>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <f04>   DW_AT_name        : (indirect string, offset: 0xc6ae4): Channel1
    <f08>   DW_AT_decl_file   : 1
    <f08>   DW_AT_decl_line   : 11
    <f08>   DW_AT_decl_column : 78
    <f09>   DW_AT_type        : <0x892>
    <f0d>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><f10>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <f11>   DW_AT_name        : (indirect string, offset: 0xc6aed): Channel2
    <f15>   DW_AT_decl_file   : 1
    <f15>   DW_AT_decl_line   : 11
    <f15>   DW_AT_decl_column : 100
    <f16>   DW_AT_type        : <0x892>
    <f1a>   DW_AT_location    : 2 byte block: 91 0 	(DW_OP_fbreg: 0)
 <2><f1d>: Abbrev Number: 0
 <1><f1e>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <f1f>   DW_AT_byte_size   : 4
    <f1f>   DW_AT_type        : <0xeb3>
 <1><f23>: Abbrev Number: 0
  Compilation Unit @ offset 0xf24:
   Length:        0x323 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x316
   Pointer Size:  4
 <0><f30>: Abbrev Number: 7 (DW_TAG_compile_unit)
    <f31>   DW_AT_producer    : (indirect string, offset: 0xb4612): GNU C11 11.3.1 20220712 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <f35>   DW_AT_language    : 29	(C11)
    <f36>   DW_AT_name        : (indirect string, offset: 0xc6cb7): ../Core/Src/PID.c
    <f3a>   DW_AT_comp_dir    : (indirect string, offset: 0x378d1): C:/Users/vutie/Desktop/KY 2/DAMH/DAMH 2/Debug
    <f3e>   DW_AT_ranges      : 0x4e
    <f42>   DW_AT_low_pc      : 0x0
    <f46>   DW_AT_stmt_list   : 0x12b2
    <f4a>   DW_AT_macros      : 0x1f819
 <1><f4e>: Abbrev Number: 1 (DW_TAG_base_type)
    <f4f>   DW_AT_byte_size   : 1
    <f50>   DW_AT_encoding    : 6	(signed char)
    <f51>   DW_AT_name        : (indirect string, offset: 0x61c16): signed char
 <1><f55>: Abbrev Number: 1 (DW_TAG_base_type)
    <f56>   DW_AT_byte_size   : 1
    <f57>   DW_AT_encoding    : 8	(unsigned char)
    <f58>   DW_AT_name        : (indirect string, offset: 0xbc44f): unsigned char
 <1><f5c>: Abbrev Number: 1 (DW_TAG_base_type)
    <f5d>   DW_AT_byte_size   : 2
    <f5e>   DW_AT_encoding    : 5	(signed)
    <f5f>   DW_AT_name        : (indirect string, offset: 0x91088): short int
 <1><f63>: Abbrev Number: 1 (DW_TAG_base_type)
    <f64>   DW_AT_byte_size   : 2
    <f65>   DW_AT_encoding    : 7	(unsigned)
    <f66>   DW_AT_name        : (indirect string, offset: 0xbacc6): short unsigned int
 <1><f6a>: Abbrev Number: 1 (DW_TAG_base_type)
    <f6b>   DW_AT_byte_size   : 4
    <f6c>   DW_AT_encoding    : 5	(signed)
    <f6d>   DW_AT_name        : (indirect string, offset: 0x101c5): long int
 <1><f71>: Abbrev Number: 1 (DW_TAG_base_type)
    <f72>   DW_AT_byte_size   : 4
    <f73>   DW_AT_encoding    : 7	(unsigned)
    <f74>   DW_AT_name        : (indirect string, offset: 0x4ac18): long unsigned int
 <1><f78>: Abbrev Number: 1 (DW_TAG_base_type)
    <f79>   DW_AT_byte_size   : 8
    <f7a>   DW_AT_encoding    : 5	(signed)
    <f7b>   DW_AT_name        : (indirect string, offset: 0x590fc): long long int
 <1><f7f>: Abbrev Number: 1 (DW_TAG_base_type)
    <f80>   DW_AT_byte_size   : 8
    <f81>   DW_AT_encoding    : 7	(unsigned)
    <f82>   DW_AT_name        : (indirect string, offset: 0x28f90): long long unsigned int
 <1><f86>: Abbrev Number: 8 (DW_TAG_base_type)
    <f87>   DW_AT_byte_size   : 4
    <f88>   DW_AT_encoding    : 5	(signed)
    <f89>   DW_AT_name        : int
 <1><f8d>: Abbrev Number: 1 (DW_TAG_base_type)
    <f8e>   DW_AT_byte_size   : 4
    <f8f>   DW_AT_encoding    : 7	(unsigned)
    <f90>   DW_AT_name        : (indirect string, offset: 0x2b73d): unsigned int
 <1><f94>: Abbrev Number: 1 (DW_TAG_base_type)
    <f95>   DW_AT_byte_size   : 8
    <f96>   DW_AT_encoding    : 4	(float)
    <f97>   DW_AT_name        : (indirect string, offset: 0xc3f49): long double
 <1><f9b>: Abbrev Number: 9 (DW_TAG_structure_type)
    <f9c>   DW_AT_name        : (indirect string, offset: 0xc6cad): PID_Param
    <fa0>   DW_AT_byte_size   : 80
    <fa1>   DW_AT_decl_file   : 2
    <fa2>   DW_AT_decl_line   : 14
    <fa3>   DW_AT_decl_column : 16
    <fa4>   DW_AT_sibling     : <0x1087>
 <2><fa8>: Abbrev Number: 2 (DW_TAG_member)
    <fa9>   DW_AT_name        : (indirect string, offset: 0xc6d0d): Target
    <fad>   DW_AT_decl_file   : 2
    <fad>   DW_AT_decl_line   : 16
    <fae>   DW_AT_decl_column : 8
    <faf>   DW_AT_type        : <0x1087>
    <fb3>   DW_AT_data_member_location: 0
 <2><fb4>: Abbrev Number: 2 (DW_TAG_member)
    <fb5>   DW_AT_name        : (indirect string, offset: 0xc6cf1): CurrVal
    <fb9>   DW_AT_decl_file   : 2
    <fb9>   DW_AT_decl_line   : 17
    <fba>   DW_AT_decl_column : 8
    <fbb>   DW_AT_type        : <0x1087>
    <fbf>   DW_AT_data_member_location: 4
 <2><fc0>: Abbrev Number: 5 (DW_TAG_member)
    <fc1>   DW_AT_name        : e
    <fc3>   DW_AT_decl_file   : 2
    <fc3>   DW_AT_decl_line   : 18
    <fc4>   DW_AT_decl_column : 8
    <fc4>   DW_AT_type        : <0x1087>
    <fc8>   DW_AT_data_member_location: 8
 <2><fc9>: Abbrev Number: 2 (DW_TAG_member)
    <fca>   DW_AT_name        : (indirect string, offset: 0xc6d07): e_Pre
    <fce>   DW_AT_decl_file   : 2
    <fce>   DW_AT_decl_line   : 19
    <fcf>   DW_AT_decl_column : 8
    <fd0>   DW_AT_type        : <0x1087>
    <fd4>   DW_AT_data_member_location: 12
 <2><fd5>: Abbrev Number: 2 (DW_TAG_member)
    <fd6>   DW_AT_name        : (indirect string, offset: 0xb9768): deltaT
    <fda>   DW_AT_decl_file   : 2
    <fda>   DW_AT_decl_line   : 20
    <fdb>   DW_AT_decl_column : 8
    <fdc>   DW_AT_type        : <0x1087>
    <fe0>   DW_AT_data_member_location: 16
 <2><fe1>: Abbrev Number: 5 (DW_TAG_member)
    <fe2>   DW_AT_name        : kP
    <fe5>   DW_AT_decl_file   : 2
    <fe5>   DW_AT_decl_line   : 22
    <fe6>   DW_AT_decl_column : 8
    <fe6>   DW_AT_type        : <0x1087>
    <fea>   DW_AT_data_member_location: 20
 <2><feb>: Abbrev Number: 5 (DW_TAG_member)
    <fec>   DW_AT_name        : uP
    <fef>   DW_AT_decl_file   : 2
    <fef>   DW_AT_decl_line   : 23
    <ff0>   DW_AT_decl_column : 8
    <ff0>   DW_AT_type        : <0x1087>
    <ff4>   DW_AT_data_member_location: 24
 <2><ff5>: Abbrev Number: 5 (DW_TAG_member)
    <ff6>   DW_AT_name        : kI
    <ff9>   DW_AT_decl_file   : 2
    <ff9>   DW_AT_decl_line   : 25
    <ffa>   DW_AT_decl_column : 8
    <ffa>   DW_AT_type        : <0x1087>
    <ffe>   DW_AT_data_member_location: 28
 <2><fff>: Abbrev Number: 5 (DW_TAG_member)
    <1000>   DW_AT_name        : uI
    <1003>   DW_AT_decl_file   : 2
    <1003>   DW_AT_decl_line   : 26
    <1004>   DW_AT_decl_column : 8
    <1004>   DW_AT_type        : <0x1087>
    <1008>   DW_AT_data_member_location: 32
 <2><1009>: Abbrev Number: 2 (DW_TAG_member)
    <100a>   DW_AT_name        : (indirect string, offset: 0xc6cd6): uI_Pre
    <100e>   DW_AT_decl_file   : 2
    <100e>   DW_AT_decl_line   : 27
    <100f>   DW_AT_decl_column : 8
    <1010>   DW_AT_type        : <0x1087>
    <1014>   DW_AT_data_member_location: 36
 <2><1015>: Abbrev Number: 2 (DW_TAG_member)
    <1016>   DW_AT_name        : (indirect string, offset: 0xc6cf9): uI_AboveLimit
    <101a>   DW_AT_decl_file   : 2
    <101a>   DW_AT_decl_line   : 28
    <101b>   DW_AT_decl_column : 6
    <101c>   DW_AT_type        : <0xf86>
    <1020>   DW_AT_data_member_location: 40
 <2><1021>: Abbrev Number: 2 (DW_TAG_member)
    <1022>   DW_AT_name        : (indirect string, offset: 0xc6d2b): uI_BelowLimit
    <1026>   DW_AT_decl_file   : 2
    <1026>   DW_AT_decl_line   : 29
    <1027>   DW_AT_decl_column : 6
    <1028>   DW_AT_type        : <0xf86>
    <102c>   DW_AT_data_member_location: 44
 <2><102d>: Abbrev Number: 5 (DW_TAG_member)
